{"nodes":[{"title":"Accepted file formats","slug":"__Advanced++++topics__Accepted++++file++++formats","shortSummary":"Obsidian recognizes the following file formats right now:Markdown files: md;Image files: png, jpg, jpeg, gif, bmp, svg;Audio files: mp3, webm, wav, m4a, ogg, 3gp, flac;Video files: mp4, webm, ogv;PDF files: pdf.All these types of files can be [[Embed files|embedded]] in"},{"title":"Community plugins","slug":"__Advanced++++topics__Community++++plugins","shortSummary":"Obsidian allows developers to write community plugins to extend Obsidian's functionality.Right now, the plugin API is in alpha status. This means any part of the API could introduce breaking changes in a future release.For developersFor instructions on creating new plugins,"},{"title":"Contributing to Obsidian","slug":"__Advanced++++topics__Contributing++++to++++Obsidian","shortSummary":"Thanks for the interest in contributing to Obsidian!There are three major ways you can contribute:1. Financial contributionCommercial licenseIf you'd like to use Obsidian for work activities, try to let your work get you a [[Commercial license|commercial license]].Add-on servicesIf you'd like"},{"title":"Customizing CSS","slug":"__Advanced++++topics__Customizing++++CSS","shortSummary":"If you are building or modifying your own css, you can open the developer tools by using Ctrl+Shift+I on Windows/Linux or Cmd+Opt+I on macOS to get information on the elements you want to customize.Changes to themes and snippets will be"},{"title":"Deleting files","slug":"__Advanced++++topics__Deleting++++files","shortSummary":"Obsidian has several options for dealing with deleted files, depending on your needs.By default, deleted files are sent to your system trash. Here you can use whatever means your system has for recovering files you've accidentally deleted.Deleted files can be"},{"title":"Drag and Drop","slug":"__Advanced++++topics__Drag++++and++++Drop","shortSummary":"There are many ways to drag and drop things around Obsidian to make the experience smoother:Drag panesSee [[Working with multiple notes#5 Panes can be rearranged by dragging|dragging panes]]Drag sourcesYou can drag a file, or multiple files from the [[file explorer]].You"},{"title":"HTML sanitization","slug":"__Advanced++++topics__HTML++++sanitization","shortSummary":"Obsidian sanitizes html for security reasons. Because it runs locally, scripting vulnerabilities are a more serious problem than they would be in a web applications. Accordingly, we are probably a bit more strict than you may be used to, and"},{"title":"How Obsidian stores data","slug":"__Advanced++++topics__How++++Obsidian++++stores++++data","shortSummary":"We believe [[Obsidian#How we're different|your data is always yours to own and control]]. Your notes are stored in markdown, which is an open format based on plain text files, and so should be readable in the future by any computer"},{"title":"Insider builds","slug":"__Advanced++++topics__Insider++++builds","shortSummary":"Insider builds are experimental versions of Obsidian that are released to Catalyst license owners, on an opt-in basis.Please note that insider builds are less stable than public versions, so if you prefer a smoother version, you don't have to enable"},{"title":"Using obsidian URI","slug":"__Advanced++++topics__Using++++obsidian++++URI","shortSummary":"Obsidian supports a custom URI protocol obsidian:// which can be used to trigger various actions within the app. This is commonly used on MacOS and mobile apps for automation and cross-app workflows.If you have Obsidian installed, this link will open"},{"title":"YAML front matter","slug":"__Advanced++++topics__YAML++++front++++matter","shortSummary":"aliases: front matterYAML, also known as front matter, is designed to be file-level metadata that is readable by humans and Obsidian.Front matter is a section of plain text attributes that starts at the first line of the file. It is"},{"title":"Slides demo","slug":"__Attachments__Slides++++demo","shortSummary":"Obsidian slides demoTo view slides, you'll need to enable the \"Slides\" plugin.\nThis can be done through the Settings => Core plugins.Obsidian goalsLongevityFoster networkPersonalizedLongevityLocal files on your hard diskPlain text, no proprietary formatMarkdown for maximum portabilitythe most popular plain text format"},{"title":"Author clustering and topic estimation for short texts","slug":"__Clustering__Author++++clustering++++and++++topic++++estimation++++for++++short++++texts","shortSummary":"Created: 2022-04-01 15:52\n#paperMain ideaThe goal is to cluster authors and, at the same time, estimate the topics in short texts.\nBy expanding [[LDA]], the algorithm models strong dependence among the words in the same document, with user-level topic distributions.ReferencesPaperCodehttps://github.com/g-tierney/stLDA-C_public"},{"title":"Cluster Consensus","slug":"__Clustering__Cluster++++Consensus","shortSummary":"Created: 2022-03-23 15:45Consider user's history (the posts she made or, more in general, her interaction with the app, like the posts that she visited and/or liked) as a partition -> similarity of posts is given by the number of common"},{"title":"Clustering","slug":"__Clustering__Clustering","shortSummary":"Created: 2022-03-23 11:51Used to improve predictions and reduce [[Cold-start]]  problem in [[Hybrid Filtering]]. Clustering is used in [[Social information]] to improve #tagging, explicit #social_link and explicit #trust_information.“No single clustering algorithm simultaneously satisfies the three basic axioms of data clustering,"},{"title":"College Library Personalized Recommendation System","slug":"__Clustering__College++++Library++++Personalized++++Recommendation++++System","shortSummary":"Created: 2022-06-03 13:14\n#paperMain ideaIn this paper an hybrid algorithm ([[Collaborative filtering]] + [[Content-based filtering]]) to recommend books is proposed.In deepSteps:Collaborative filtering: given the matrix R=UxI where U is the set of users and I is the set of categories, $R_{i,j}$"},{"title":"Evaluate Clustering","slug":"__Clustering__Evaluate++++Clustering","shortSummary":"Created: 2022-04-29 15:26\n#noteWe need metrics that work when the truth labels are not known.External validationThe methods used to implement this measure need ground truths.\nExamples:Measures based on matching:Purity: Cluster $C_i$ contains points only from one ground truth partition;Maximum matching: based on"},{"title":"HDBSCAN","slug":"__Clustering__HDBSCAN","shortSummary":"Created: 2022-04-21 16:28\n#noteI'll try to use this clustering method with [[UMAP]] for dimensionality reduction.It is a density-based clustering approach, so it is applied in three steps:Estimate of the densities;Pick regions of high density;Combine points in these selected regionsEstimating densitiesIt is"},{"title":"UMAP","slug":"__Clustering__UMAP","shortSummary":"Created: 2022-04-21 16:33\n#noteUMAP (Uniform Manifold Approximation and Projection for Dimension Reduction) is much faster and more scalable than t-SNE, while also preserving the global structure of the data much better. This makes it useful for both visualization and as a"},{"title":"WEClustering","slug":"__Clustering__WEClustering","shortSummary":"Created: 2022-04-21 18:33\n#paperMain ideaClutering technique based on word embeddings obtained from [[Transformer]] models (in particular BERT). It is supposed to deal with problems as synonymy, polysemy, high dimensionality and sparseness of data.In deepWEClustering combines the advantages of contextual word embeddings"},{"title":"Current version","slug":"__Concepts__Current++++version","shortSummary":"Your current version is your Obsidian version. This is the version number that you’ll see in the [[Title bar]] and the [[Vault switcher]].You can have most of the new features and bug fixes by having an up-to-update current version. However,"},{"title":"Installer version","slug":"__Concepts__Installer++++version","shortSummary":"If you look closely in Settings -> About, you can find your current version and your installer version.Installer version will not increase when you [[Update Obsidian|auto-update]], unlike the [[Current version]]. Your installer version will only increase when you install Obsidian"},{"title":"Interface language","slug":"__Concepts__Interface++++language","shortSummary":"The interface of Obsidian has been translated to various languages by [[Credits#Translators|our amazing volunteer translators]]. You can change the interface language either in Settings → About or in the [[Vault switcher]].Don’t see your language in the list or seeing untranslated"},{"title":"Appearance","slug":"__Customization__Appearance","shortSummary":"Base themeObsidian comes with two base themes, light and dark. This option sets the default color scheme your theme will use to either display its light or dark mode version.Custom themeThere are lots of community themes contributed by our amazing"},{"title":"Custom hotkeys","slug":"__Customization__Custom++++hotkeys","shortSummary":"Most hotkeys are customizable in Obsidian.We only defined default hotkeys for the most commonly used commands, but if you frequently use a command, it would save you lots of time if you add a hotkey for it.For a list of"},{"title":"Keyerror in Coherence (by gensim)","slug":"__Debugging__Keyerror++++in++++Coherence++++(by++++gensim)","shortSummary":"Created: 2022-09-08 11:41\n#noteIt is caused by the fact that the topics contain words that are not in the dictionary.It was fixed in the latest versions of gensim, so just update the version (>4.1.0).ReferencesGitHub issueCodeTags#bug"},{"title":"Getting Started","slug":"__Getting++++Started","shortSummary":"Getting startedRun on your local machineSteps to run it on your local machine:Clone this Github repoInstall yarn package managerCopy all of your markdown file (.md only) and folder to /posts/ except /posts/index.md fileGo to root folder of your project, run"},{"title":"Add aliases to note","slug":"__How++++to__Add++++aliases++++to++++note","shortSummary":"aliases: alias, aliasesSometimes, you might want to refer to the same file with multiple names in different contexts. These alternative names are what we call \"aliases\".For example, you might want to refer to your partner by their full name, first"},{"title":"Add custom styles","slug":"__How++++to__Add++++custom++++styles","shortSummary":"When you want to add custom styles to your vault, there are two main ways to do this:Vault stylesThemesThemes allow you to toggle the appearance of your vault with a dropdown menu once they have been added to your vault's"},{"title":"Basic note taking","slug":"__How++++to__Basic++++note++++taking","shortSummary":"If you've just opened Obsidian, you'll see two documents here. The one in the left pane is a text file, which you can edit using Markdown syntax. The one in the right pane is a Preview of the same text"},{"title":"Capture information","slug":"__How++++to__Capture++++information","shortSummary":"Copy and pasteWhen you see something useful online, you can simply select the text, copy, and paste in Obsidian. Obsidian will try to convert it into proper Markdown so that it fits right in.If you only wish to copy the"},{"title":"Change settings","slug":"__How++++to__Change++++settings","shortSummary":"The settings can be found by clicking the gear in the bottom left corner, or by hitting Ctrl/Cmd-,. Most of them are fairly self-explanatory, but here are some notes that might be helpful.Most of the settings are toggle switches. If"},{"title":"Create notes","slug":"__How++++to__Create++++notes","shortSummary":"Notes are created in a few ways, depending on your workflow:Note-first approach. If you need to create a note, you can do so in [[File explorer]]. The keyboard shortcut is Ctrl/Cmd+N. Also, if you have the [[Command palette]] plugin enabled"},{"title":"Embed files","slug":"__How++++to__Embed++++files","shortSummary":"Embed attachmentsYou can embed attachment files like images or audio in your notes. Use the ![[filename.png]] syntax like so:![[Engelbart.jpg]]![[Excerpt from Mother of All Demos (1968).ogg]]You can embed a PDF file in your notes with the same syntax. Additionally, you can"},{"title":"Folding","slug":"__How++++to__Folding","shortSummary":"Folding text is an extremely powerful tool for outlining or writing, in order to focus on what you're working on.To use folding, go to Settings (the gear icon on the left) => Editor and turn on Fold indent and Fold"},{"title":"Format your notes","slug":"__How++++to__Format++++your++++notes","shortSummary":"Obsidian is a Markdown-based note-taking and knowledge base app.We currently support the formats below:Internal linkingLink to a page: [[Internal link]].Link to a page: [[Internal link]].EmbedsEmbed another file (read more about [[Embed files]]). Here's an embedded section:![[Obsidian#What is Obsidian]]![[Obsidian#What is Obsidian]]Headers#"},{"title":"Import data","slug":"__How++++to__Import++++data","shortSummary":"There are a few differences between the way various PKM and note taking systems work that mean moving between them can be a little complicated. For the most part, if whatever you're using can be converted to markdown, it will"},{"title":"Internal link","slug":"__How++++to__Internal++++link","shortSummary":"Internal links are the backbone of your knowledge network.Link to filesTo create an internal link, simply type [[. This will prompt you with the list of notes you can link to. Use Up arrow and Down arrow to navigate the"},{"title":"Link to blocks","slug":"__How++++to__Link++++to++++blocks","shortSummary":"In Obsidian 0.9.5 or higher, in addition to [[Internal link#Link to headings|linking to headings]], you can also link to blocks.What is a blockA \"block\" can be a paragraph, a blockquote, a list item, etc. In general, anything that has empty"},{"title":"Manage attachments","slug":"__How++++to__Manage++++attachments","shortSummary":"Add an attachmentThere are several ways to include attachments in your notes:Copy and paste;Drag and drop;Download or copy file to vault folder.After being added, these attachment files are just normal files and can still be accessed through your file system.Please"},{"title":"Preview and edit modes","slug":"__How++++to__Preview++++and++++edit++++modes","shortSummary":"In obsidian, a document can be viewed in either edit mode or preview mode. In edit mode, you will see basic markdown rendering, but certain things, like code syntax highlighting and embedded files, will only show up in preview mode."},{"title":"Rename notes","slug":"__How++++to__Rename++++notes","shortSummary":"If you're already editing the note, you can rename it simply by editing the text in the title:![[Pasted image 6.png]]If you want to rename a note that you're not editing, go to [[file explorer]], right-click on the note or folder"},{"title":"Update Obsidian","slug":"__How++++to__Update++++Obsidian","shortSummary":"How auto-update worksObsidian checks for update every 12 hours. Once an update is available, restarting the app will automatically bring you to the latest version.You can check your current version, check for updates in Settings => About. You can also"},{"title":"Use hotkeys","slug":"__How++++to__Use++++hotkeys","shortSummary":"Hotkeys help you get work done faster. If you frequently perIf you have the [[Command palette]] enabled, You can use Ctrl/Cmd+P to bring it up, which will show you all currently available commands and hotkeys.Most hotkeys can be [[Custom hotkeys|customized]]"},{"title":"Working with backlinks","slug":"__How++++to__Working++++with++++backlinks","shortSummary":"Backlinks are one of the most powerful features of Obsidian. As a result, they can sometimes be a bit confusing, so here's some things that might help.The Backlinks panel has two sections, Linked mentions and Unlinked mentions.![[Backlinks.png]]As you can see,"},{"title":"Working with multiple cursors","slug":"__How++++to__Working++++with++++multiple++++cursors","shortSummary":"If you hold down Alt (option on mac) and click, you can create multiple cursors. This can be useful when modifying a lot of lines in the same way, for example putting - at the beginning of multiple lines to"},{"title":"Working with multiple notes","slug":"__How++++to__Working++++with++++multiple++++notes","shortSummary":"You can edit and view multiple files in Obsidian.To effectively use split view, you only need to know a few things:1. ==Use Ctrl/Cmd key== when you want to open things in a new pane.By default, when you click something, it"},{"title":"Working with multiple vaults","slug":"__How++++to__Working++++with++++multiple++++vaults","shortSummary":"Each collection of notes in Obsidian is known as a Vault. A Vault consists of a folder, and any sub-folders within it. Right now, you're looking at the Obsidian Help Vault, which is just a folder of files included with"},{"title":"Working with tags","slug":"__How++++to__Working++++with++++tags","shortSummary":"Tags are a very useful way of grouping multiple notes so they are easy to find. A tag is essentially a clickable search through your entire Vault for a term. For example, clicking on #tags will bring up a search"},{"title":"Behavioral Questions","slug":"__Interviews__Behavioral++++Questions","shortSummary":"Questions from some companiesGeneral questions:Why do you want to work for X company?Why do you want to leave your current/last company?What are you looking for in your next role?Tell me about a time when you had a conflict with a"},{"title":"Best questions to ask for knowing more about technical work","slug":"__Interviews__Best++++questions++++to++++ask++++for++++knowing++++more++++about++++technical++++work","shortSummary":"What are the engineering challenges that the company/team is facing?What has been the worst technical blunder that has happened in the recent past? How did you guys deal with it? What changes were implemented afterwards to make sure it didn't"},{"title":"Best questions to ask for knowing more about the role","slug":"__Interviews__Best++++questions++++to++++ask++++for++++knowing++++more++++about++++the++++role","shortSummary":"What qualities do you look out for when hiring for this role?What would be the most important problem you would want me to solve if I joined your team?What does a typical day look like in this role?What are the"},{"title":"Best questions to ask for knowing more culture and welfare","slug":"__Interviews__Best++++questions++++to++++ask++++for++++knowing++++more++++culture++++and++++welfare","shortSummary":"What is the most frustrating part about working here?What is unique about working at this company that you have not experienced elsewhere?What is something you wish were different about your job?How is individual performance measured?What do you like about working"},{"title":"Best questions to ask for knowing the company business model","slug":"__Interviews__Best++++questions++++to++++ask++++for++++knowing++++the++++company++++business++++model","shortSummary":"General questions:Who are the main users of your product?What are the use cases you're targeting?How many people does your company have? How many are engineers? How many are in sales?For enterprise products, you might want to ask:How many customers do"},{"title":"Best questions to ask for knowing what the (ML) jobs entails","slug":"__Interviews__Best++++questions++++to++++ask++++for++++knowing++++what++++the++++(ML)++++jobs++++entails","shortSummary":"How much of the job involves developing ML models?How much of the job involves data exploration and data wrangling? What are the characteristics of the data you'd have to work with, e.g. size, format?How much of the job involves DevOps?Does"},{"title":"Best questions to ask to know more about company direction","slug":"__Interviews__Best++++questions++++to++++ask++++to++++know++++more++++about++++company++++direction","shortSummary":"How does the company decide on what to work on next?What assurance do you have that this company will be successful?Which companies are your main competitors and what differentiates your company?What are your highest priorities right now? For example, new"},{"title":"Arrays","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Arrays","shortSummary":"Arrays hold values of the same type at contiguous memory locations. In an array, we're usually concerned about two things - the position/index of an element and the element itself.Advantages:store multiple elements of the same type with just one variable;accessing"},{"title":"Dynamic programming","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Dynamic++++programming","shortSummary":"Dynamic Programming (DP) is usually used to solve optimization problems.Tips: Sometimes you do not need to store the whole DP table in memory, the last two values or the last two rows of the matrix will suffice.ResourcesTech Interview HandbookDemystifying Dynamic"},{"title":"Graph","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Graph","shortSummary":"A graph is a structure containing a set of objects (nodes or vertices) where there can be edges between these nodes/vertices. Edges can be directed or undirected, and can optionally have values (a weighted graph). [[Tree]]s are undirected graphs in"},{"title":"Hash Table","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Hash++++Table","shortSummary":"The Hash Table, or hash map, is a data structure that implements an associative array abstract data type, a structure that can map keys to values. A hash table uses a hash function on an element to compute an index,"},{"title":"Heap","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Heap","shortSummary":"A heap is a specialized tree-based data structure which is a complete tree that satisfies the heap property.Max heap - In a max heap the value of a node must be greatest among the node values in its entire subtree."},{"title":"Interval","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Interval","shortSummary":"Interval questions are a subset of array questions where you are given an array of two-element arrays (an interval) and the two values represent a start and an end value. Interval questions are considered part of the array family but they involve"},{"title":"Linked List","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Linked++++List","shortSummary":"Like arrays, a linked list is used to represent sequential data. It is a linear collection of data elements whose order is not given by their physical placement in memory, as opposed to arrays, where data is stored in sequential"},{"title":"Matrix","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Matrix","shortSummary":"A matrix is a 2-dimensional array. They are often used for [[Dynamic Programming]] and [[Graph]] problems.Corner cases:Empty matrix. Check if none of the arrays have 0 as length;1x1 matrix;matrix with just one row or column.Techniques:Creating an empty NxM matrix: for"},{"title":"Queue","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Queue","shortSummary":"A queue is a linear collection of elements that are maintained in a sequence. The sequence can be modified by the addition of elements at one end of the sequence (enqueue operation) and the removal of elements from the other end"},{"title":"Recursion","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Recursion","shortSummary":"Recursion is a method of solving a computational problem where the solution depends on solutions to smaller instances of the same problem.\r\nAll recursive functions contain two parts:A base case (or cases) defined, which defines when the recursion is stopped, otherwise"},{"title":"Sorting and searching","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Sorting++++and++++searching","shortSummary":"Most of the basic sorting algorithms run in $O(n^2)$, and they are not to be used. Instead, use your programming language's default sorting function.Time complexity\r\n| Algorithm      | Time       |"},{"title":"Stack","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Stack","shortSummary":"A stack is an abstract data type that supports the operations push (insert a new element on the top of the stack) and pop (remove and return the most recently added element, the element at the top of the stack). As an abstract data"},{"title":"String","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__String","shortSummary":"A string is a sequence of characters.Time complexity (operations on single string)\r\n|Operation|Big-O|\r\n|----|----|\r\n|Access|O(1)|\r\n|Search|O(n)|\r\n|Insert|O(n)|\r\n|Remove|O(n)|Time complexity (operations on 2 strings)\r\n|Operation|Big-O|Note|\r\n|---|---|---|\r\n|Find substring|O(nm)|This is the most naive case. There are more efficient algorithms for string searching such as the KMP algorithm|\r\n|Concatenating strings|O(n+m)||\r\n|Slice|O(m)||\r\n|Split (by token)|O(n+m)||\r\n|Strip (remove"},{"title":"Tree","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Tree","shortSummary":"A tree is a widely used abstract data type that represents a hierarchical structure with a set of connected nodes. Each node in the tree can be connected to many children, but must be connected to exactly one parent, except"},{"title":"Trie","slug":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Trie","shortSummary":"Tries are special [[Tree]]s (prefix trees) that make searching and storing strings more efficient. Tries have many practical applications, such as conducting searches and providing autocomplete.Time complexity\r\nm is the length of the string used in the operation.\r\n| Operation | Big-O"},{"title":"Do's to preprare interviews","slug":"__Interviews__Do's++++to++++preprare++++interviews","shortSummary":"Start your preparation early, even way before you start looking for your first job.Get someone to refer you. The world runs on social capital. Many companies have a huge backlog of resumes and the chance of a random resume getting"},{"title":"Machine Learning LinkedIn questions","slug":"__Interviews__GitHub++++questions__Machine++++Learning++++LinkedIn++++questions","shortSummary":"Machine Learning (here)Q1. You are part of a data science team that is working for a national fast-food chain. You create a simple report that shows trend: Customers who visit the store more often and buy smaller meals spend more"},{"title":"Python LinkedIn questions","slug":"__Interviews__GitHub++++questions__Python++++LinkedIn++++questions","shortSummary":"Python (here)Q1. What is an abstract class?[ ] An abstract class is the name for any class from which you can instantiate an object.[ ] Abstract classes must be redefined any time an object is instantiated from them.[ ] Abstract"},{"title":"Interviews, personal questions (IT)","slug":"__Interviews__Interviews,++++personal++++questions++++(IT)","shortSummary":"Perché ti sei candidato al programma di Mentorship?Sono alla fine del mio percorso universitario e, nonostante io sia soddisfatto della preparazione tecnica che ho acquisito in questi anni, per rendere al massimo del mio potenziale durante la carriera lavorativa che"},{"title":"ML Questions Examples","slug":"__Interviews__ML++++Questions++++Examples","shortSummary":"What is batch normalization? What are its drawbacks? Describe normalizations that rectify them.Explain bias-variance trade-off.List common generative models and their pros and cons.Why is it difficult to train vanilla GANs? How can you improve the training.How would you prevent a"},{"title":"Normalization, Standardization and Regularization","slug":"__Interviews__QambersandA++++to++++ML++++questions__Normalization,++++Standardization++++and++++Regularization","shortSummary":"Created: 2023-02-17 12:06\n#noteNormalization adjusts the data -> if the data is on a very different scale, we need to normalize it (generally in a range [0,1]);Standardization re-scales data to have a mean of 0 and a standard deviation of 1;Regularization"},{"title":"Vectors","slug":"__Interviews__QambersandA++++to++++ML++++questions__Vectors","shortSummary":"What’s the geometric interpretation of the dot product of two vectors?\nThe dot product (or inner product) between two vector $\\vec{a}$ and $\\vec{b}$ is considered as the projection of $\\vec{a}$ onto $\\vec{b}$ multiplied by the length of $\\vec{b}$, i.e. $\\vec{a}\\cdot\\vec{b}=\\lVert \\vec{a}"},{"title":"Questions about Communication","slug":"__Interviews__Questions++++about++++Communication","shortSummary":"Tell me about a time you had to give constructive criticism.Tell me about a time you received critical feedback.Have you ever disagreed with your manager? How did you address that?How would your coworkers describe your communication style?What was the most"},{"title":"Questions about Interest in the field","slug":"__Interviews__Questions++++about++++Interest++++in++++the++++field","shortSummary":"Why are you interested in ML?What interests you about this position?What do you hope to learn in your next job?In your current role, for what types of problems are you the go-to person? If I asked others on your team"},{"title":"Questions about Personality","slug":"__Interviews__Questions++++about++++Personality","shortSummary":"How would your colleagues describe you?If you were interviewing a potential teammate, what traits would you look for?If you needed a partner to solve a programming problem, how would you describe your ideal partner?If you could go back to five"},{"title":"Useful Links","slug":"__Interviews__Useful++++Links","shortSummary":"SE positions:Tech Interview HandbookCoding Interview UniversityThe missing semester of your CS EducationML notes and tips:Data Science Interview BookTowards Data ScienceNotes on AI (Obsidian)ML and AI CompendiumML Interviews bookML conceptsML Questions and AnswersAcing AI InterviewsIn-person interview:AmazonAmazon PrinciplesStar Response MethodOther tools:Generator of"},{"title":"Survey on Knowledge Graph for RecSys","slug":"__Knowledge++++Graph__Survey++++on++++Knowledge++++Graph++++for++++RecSys","shortSummary":"Created: 2022-08-12 15:49\n#noteA knowledge graph is a heterogeneous graph where nodes represent entities and edges represent relations between entities -> we can map items and their attributes to understand the mutual relations between items.\nThis can help in case of data"},{"title":"Catalyst license","slug":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license","shortSummary":"Obsidian is free for personal use. A Catalyst license is an optional license that provides the following benefits:It gives you early access to the latest, cutting edge versions of the app;Provides you cool badges on our community Discord server and"},{"title":"Commercial license","slug":"__Licenses++++ambersand++++add-on++++services__Commercial++++license","shortSummary":"About Obsidian commercial licenseObsidian is free for personal use. For commercial (business) use in a company of two (2) or more employees, a commercial license is required. Business use includes any work-related activities such as capturing meeting notes, maintaining team"},{"title":"Obsidian Publish","slug":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish","shortSummary":"Obsidian Publish™ is a paid hosting service for your notes.For instructions on how to publish your notes from within the Obsidian app, refer to the [[Publish|Publish plugin]].PrivacyYou have total control over what to publish via the [[Publish|Publish plugin]] - either"},{"title":"Obsidian Sync","slug":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync","shortSummary":"Obsidian Sync™ is a paid service to sync notes between vaults on various devices.How Obsidian Sync worksObsidian Sync is fairly simple: once you hook up local vaults from multiple devices to the same remote vault, changes will be automatically synced"},{"title":"Obsidian Unlimited","slug":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Unlimited","shortSummary":"Obsidian Unlimited is a way to contribute a custom amount to Obsidian develop as you wish. You can also contribute multiple times at any time.You can find this option at the bottom of the page in your Obsidian account page"},{"title":"Refund policy","slug":"__Licenses++++ambersand++++add-on++++services__Refund++++policy","shortSummary":"Obsidian Catalyst and Unlimited[[Catalyst license]] purchases and Obsidian Unlimited donations are to support Obsidian's development. ==They are not refundable.==Although they might give you exclusive early access to insider builds or feature betas, we do not sell them as a product.We"},{"title":"Activation functions","slug":"__Machine++++Learning__Activation++++functions","shortSummary":"Created: 2022-12-02 16:21\n#noteActivation functions \"decide\" if the neuron should fire or not.Step functionIt is just a threshold based activation function, it does not give intermediate values. It is not really good for non binary activations.\n![[step_function.png]]Linear functionThe activation is proportional to"},{"title":"Bias-Variance Tradeoff","slug":"__Machine++++Learning__Bias-Variance++++Tradeoff","shortSummary":"Created: 2022-12-02 14:23\n#noteBias: it is the difference between the average prediction of our model and the correct value which we are trying to predict. High bias indicates an oversimplified model. It is evident in case of high error on training"},{"title":"Contrastive Loss","slug":"__Machine++++Learning__Contrastive++++Loss","shortSummary":"Created: 2022-07-07 11:40\n#noteContrastive loss has been used recently in a number of papers showing state of the art results with unsupervised learning.\nIt is used when we need to compare the outputs produced from two different inputs (e.g. like in Siamese"},{"title":"Curse of dimensionality","slug":"__Machine++++Learning__Curse++++of++++dimensionality","shortSummary":"Created: 2022-12-02 15:14\n#noteIt is a phenomenon that happens when data increases in dimensions and, by consequence, the computational effort required to process the data increases.It would be normal to think that by adding more information to the data, the quality"},{"title":"Accumulate Gradient","slug":"__Machine++++Learning__DL__Accumulate++++Gradient","shortSummary":"Created: 2023-04-04 11:59\n#quicknoteUse gradient accumulation to train models with large batch sizes in order to work around hardware limitations when GPU memory is a concern.Gradient accumulation is a way to virtually increase the batch size during training, which is very"},{"title":"Adaptive Machine Translation with LLMs","slug":"__Machine++++Learning__DL__Adaptive++++Machine++++Translation++++with++++LLMs","shortSummary":"Created: 2023-03-15 16:31\n#paperMain ideaThe authors conducted several months of experiments to find out whether GPT-3 is capable of enhancing [[Adaptive Machine Translation]], defined as simultaneously improving the quality of new translations based on user feedback.\nUser feedback can take several forms,"},{"title":"Adaptive Machine Translation","slug":"__Machine++++Learning__DL__Adaptive++++Machine++++Translation","shortSummary":"Created: 2023-03-15 16:47\n#quicknoteAdaptive MT is a type of machine translation that utilizes feedback from users to improve the quality of the translations over time. Feedback usually includes corrections to previous translations, terminology and style guides, as well as ratings of"},{"title":"Adversarial Networks","slug":"__Machine++++Learning__DL__Adversarial++++Networks","shortSummary":"Created: 2022-03-24 16:15There are two schools of thinking in #ir:generative retrieval assumes that there is a common generative process between documents and queries, so a retrieval task can be performed by generating the relevant document i given the query q;discriminative"},{"title":"Autoencoder","slug":"__Machine++++Learning__DL__Autoencoder","shortSummary":"Created: 2022-03-24 10:16An autoencoder is a neural network that reconstructs its input data in the output layer-> the encoder maps the input to an internal representation and the decoder that maps this representation to a reconstruction of the input.Pros: #dimensionality_reduction,"},{"title":"Back Propagation","slug":"__Machine++++Learning__DL__Back++++Propagation","shortSummary":"Created: 2022-12-02 17:08\n#noteIt is the method used to updates the parameters after a forward pass (so it is used during the backward pass).The key element used in back propagation is the chain rule of differentiation. It states that: if $y=f(u)$"},{"title":"CLIP - Contrastive Language-Image Pre-Training","slug":"__Machine++++Learning__DL__CLIP++++-++++Contrastive++++Language-Image++++Pre-Training","shortSummary":"Created: 2022-07-01 10:02\n#paperMain ideaCLIP is a multimodal model released by OpenAI. It works very well in Zero-shot learning tasks.\nA CLIP model consists of two encoders, one for texts and the other for images, that map images and texts to the"},{"title":"CNN","slug":"__Machine++++Learning__DL__CNN","shortSummary":"Created: 2022-03-24 10:06Convolutional neural network is a class of Artificial Neural Network most commonly used to analyze visual imagery (but not only).\nThe NNs that belong to this class are specialized for grid-like data (like images).They are inspired by biological processes,"},{"title":"Cost of fine-tuning LLMs","slug":"__Machine++++Learning__DL__Cost++++of++++fine-tuning++++LLMs","shortSummary":"How many hours?Alpaca-7B (Llama + LoRA): 3 epochs, 40-52k instructions (Stanford Alpaca), quantization-> ==1 hour== with A100 on Colab, (cabrita), ==1 hour== with 3090 (camoscio)FlanT5-xxl (11B) sharded with LoRA: g5.2xlarge AWS EC2 Instance, including 1 NVIDIA A10G (18GB) for ==10"},{"title":"Data2Vec - A General Framework for Self-supervised Learning in Speech, Vision and Language","slug":"__Machine++++Learning__DL__Data2Vec++++-++++A++++General++++Framework++++for++++Self-supervised++++Learning++++in++++Speech,++++Vision++++and++++Language","shortSummary":"Created: 2022-07-12 09:13\n#paperThis paper proposes a unified framework for Self-Supervised Learning in three modalities: images, texts and speech. It achieves SOTA result in all three modalities.\nNote: this work is not about multimodal learning, i.e during training just one of the"},{"title":"Deep Reinforcement Learninig","slug":"__Machine++++Learning__DL__Deep++++Reinforcement++++Learninig","shortSummary":"Created: 2022-03-24 16:08This paper is about a news recommendation system, DRN.This paper proposes an approach to solve [[Cold-start]] problem with RL and bi-clustering.Contextual-bandit approach has shown superior recommendation performance in real-world applications.Referenceshttps://arxiv.org/pdf/1707.07435.pdfhttps://dl.acm.org/doi/pdf/10.1145/3178876.3185994https://arxiv.org/pdf/1801.05532.pdfhttps://arxiv.org/pdf/1003.0146.pdfTags#drl"},{"title":"Diffusion models","slug":"__Machine++++Learning__DL__Diffusion++++models","shortSummary":"Created: 2022-11-28 17:38\n#noteReferencesHugging Face courseThe annotated diffusion modelCodeCode from HF courseTags"},{"title":"Graph Neural Network","slug":"__Machine++++Learning__DL__Graph++++Neural++++Network","shortSummary":"Created: 2022-03-24 17:34Referenceshttps://paperswithcode.com/paper/graph4rec-a-universal-toolkit-with-graphCodehttps://github.com/PaddlePaddle/PGL/tree/main/apps/Graph4RecTags#gnn"},{"title":"LoRA - Low-Rank Adaptation of LLMs","slug":"__Machine++++Learning__DL__LoRA++++-++++Low-Rank++++Adaptation++++of++++LLMs","shortSummary":"Created: 2023-03-21 09:48\n#paperMain ideaLoRA is a PEFT method that consists in freezing the pretrained model weights and injects trainable rank decomposition matrices into each layer of the Transformer architecture.\nCompared to GPT-3 175B fine-tuned with Adam, LoRA can reduce the number"},{"title":"Masked LM vs Causal LM","slug":"__Machine++++Learning__DL__Masked++++LM++++vs++++Causal++++LM","shortSummary":"Created: 2022-08-21 11:24\r\n#noteMLM: task of predicting the masked items (they are randomly chosen), so both the right and the left contexts need to be used.\r\nCLM: task of predicting the next token, so the model is just concerned with the left"},{"title":"Neural Autoregressive Distribution Estimation","slug":"__Machine++++Learning__DL__Neural++++Autoregressive++++Distribution++++Estimation","shortSummary":"Created: 2022-03-24 15:57Ispired by [[Restricted Boltzmann machine(RBM)]]-CF, NADE is a tractable distribution estimator which provides a desirable alternative to #rbm .Referenceshttps://arxiv.org/pdf/1707.07435.pdfhttps://jmlr.org/papers/volume17/16-272/16-272.pdfhttps://arxiv.org/pdf/1612.07146.pdfTags#nade"},{"title":"Neural attention","slug":"__Machine++++Learning__DL__Neural++++attention","shortSummary":"Created: 2022-03-24 10:18Attention = vector of importance weights that predicts the next item -> the system can focus on a particular element to make recommendations by avoiding noisy or uninformative content.\nIt can be integrated with [[CNN]].Types:vanilla attention models use parametrized"},{"title":"PEFT - Parameter-Efficient Fine-Tuning","slug":"__Machine++++Learning__DL__PEFT++++-++++Parameter-Efficient++++Fine-Tuning","shortSummary":"Created: 2023-03-07 17:48\n#note[[Large Language Models (LLMs)]] based on the [[Transformer]] architecture are considered SOTA in several NLP (and not only) tasks. A typical way to use such models is to fine-tune large-scale pretrained generic models to downstream tasks. Fine-tuning could"},{"title":"Quantization","slug":"__Machine++++Learning__DL__Quantization","shortSummary":"Created: 2023-04-04 11:48\n#quicknoteQuantization is a technique to reduce the computational and memory costs of running inference by representing the weights and activations with low-precision data types like 8-bit integer (int8) instead of the usual 32-bit floating point (float32).Reducing the number"},{"title":"RNN","slug":"__Machine++++Learning__DL__RNN","shortSummary":"Created: 2022-03-24 10:09Very useful for sequential data processing, i.e. temporal dynamics or patterns -> good in case we want to consider temporal evolution of user's interestsConsider variants like LSTM or GRU for vanishing gradient problem.Good for session in which user"},{"title":"Restricted Boltzmann Machines (RBM)","slug":"__Machine++++Learning__DL__Restricted++++Boltzmann++++Machines++++(RBM)","shortSummary":"Created: 2022-12-20 16:38\n#noteInvented by Geoffrey Hinton, a Restricted Boltzmann machine is an algorithm useful for dimensionality reduction, classification, regression, collaborative filtering, feature learning and topic modelling.\nRBMs are shallow, two-layer neural nets that constitute the building blocks of deep-belief networks. The first layer"},{"title":"Transformer","slug":"__Machine++++Learning__DL__Transformer","shortSummary":"Created: 2022-03-24 11:30Referenceshttps://arxiv.org/pdf/1904.06690.pdfhttps://towardsdatascience.com/build-your-own-movie-recommender-system-using-bert4rec-92e4e34938c5Codehttps://github.com/NVIDIA-Merlin/publications/blob/main/2021_acm_recsys_transformers4rec/recsys21_transformers4rec_paper.pdfhttps://www.kaggle.com/code/vineethakkinapalli/sentence-transformer-based-recommender-system/notebookTags#transformer"},{"title":"Unlock LLMs' potential","slug":"__Machine++++Learning__DL__Unlock++++LLMs'++++potential","shortSummary":"Created: 2023-03-09 17:36\n#noteTo truly take advantage of the potential of [[Large Language Models (LLMs)]] we have to adapt them for our tasks. For most teams, the best option is to use an established model and hone it to fit a"},{"title":"Wide & Deep Learning","slug":"__Machine++++Learning__DL__Wide++++ambersand++++Deep++++Learning","shortSummary":"Created: 2022-03-24 12:20\r\n#paperMain ideaBy using joyntly a linear and a neural components this model achieves both memorisation and generalisation.In deepA goal in recommendation systems is to achieve both memorization and generalization.\r\nMemorisation can be defined as the capacity of the system"},{"title":"Gradient Descent","slug":"__Machine++++Learning__Gradient++++Descent","shortSummary":"Created: 2022-12-02 14:50\n#noteGradient descent is an optimization algorithm used to find the values of parameters of a function to minimizes a cost function.\nIt is an iterative approach, in which at each iteration we compute the derivative of the cost so"},{"title":"Kernel trick","slug":"__Machine++++Learning__Kernel++++trick","shortSummary":"Created: 2023-01-10 12:03\n#noteThe kernel trick avoids the explicit mapping that is needed to get linear learning algorithms to learn a nonlinear function or decision boundary.A kernel is a function that takes as inputs vectors in the original space and returns the dot product"},{"title":"Losses","slug":"__Machine++++Learning__Losses","shortSummary":"Created: 2022-04-25 11:50\n#noteWe often use \"cost function\" and \"loss function\" as synonymous, but they are different:loss function: it is for a single training example/input;cost function: it is the average loss over the entire training dataset.RegressionMean Squared ErrorAlso called squared loss"},{"title":"Artifacts","slug":"__Machine++++Learning__MLOps__Artifacts","shortSummary":"Created: 2023-02-13 10:37\n#noteArtifact are any entities that are created and/or consumed during a process.\nIn software engineering ([[DevOps]]) we deal primarily with two artifacts: code and records (requirements, test results etc).\nSoftware engineering process deals with managing life cycle of artifacts. During"},{"title":"AutoML","slug":"__Machine++++Learning__MLOps__AutoML","shortSummary":"Created: 2023-02-13 14:46\n#noteAutoML is the automation of machine learning activities to enable modeling building and  decision-making without human intervention throughout the ML life cycle.Scope:feature engineering -> delete useless feature, feature correlation and selection;model training -> model selection, hyperparameter tuning,"},{"title":"Data Governance","slug":"__Machine++++Learning__MLOps__Data++++Governance","shortSummary":"Created: 2023-02-13 11:54\n#noteIt is the practice of ensuring consistency, integrity, security, and usability of data through an organization of people, policies, and processes.Tags#mlops #ml #data #datagovernace"},{"title":"Data Pipeline","slug":"__Machine++++Learning__MLOps__Data++++Pipeline","shortSummary":"Created: 2023-02-13 11:39\n#noteIt helps creating repeatable machine learning processes while reducing human costs.Functions:fetch data from source;cleansing, filtering, and validation;transformations and enrichment;feature store operations;continuous cycle;Managed data pipelines:Engineering life cycle;traceability;reproducibility;automation.Tags#mlops #ml"},{"title":"Evolution of ML use cases","slug":"__Machine++++Learning__MLOps__Evolution++++of++++ML++++use++++cases","shortSummary":"Created: 2023-02-13 11:06\n#noteExploration -> small team which studies the technology ecosystem, scouts use cases, and collect sample data. They also try modeling ang e they check if the project is doable;Experimentation -> bigger team which selects a use case, collects"},{"title":"Experiment Tracking","slug":"__Machine++++Learning__MLOps__Experiment++++Tracking","shortSummary":"Created: 2023-02-13 14:41\n#noteEach ML training run is considered and experiment. Experiment tracking helps manage the evolution of an ML model toward stated performance goals.We can track model (different version and hyperparameters), inputs, outputs, and results.Benefits:measure impact of changing model parameters;identify"},{"title":"Features","slug":"__Machine++++Learning__MLOps__Features","shortSummary":"Created: 2023-02-13 11:47\n#noteFeature validation pipeline:basic feature validation (missing or erroneous data, data formats);data distribution validation (mean, quartiles etc);out of distribution validation (values beyond quartiles and new class values);correlation validation (feature vs target)Managed feature stored:centralized store for features;preprocessed and ready for"},{"title":"Intro to MLOps","slug":"__Machine++++Learning__MLOps__Intro++++to++++MLOps","shortSummary":"Created: 2023-02-13 10:15\n#noteMLOps is considered as a set of best practices that helps manage the creation and use of ML artifacts through efficient workflows, collaboration, and tracking.\nIt is an extension of [[DevOps]] for the ML field.\nIt enables continuous model development"},{"title":"ML Deployment","slug":"__Machine++++Learning__MLOps__ML++++Deployment","shortSummary":"Created: 2023-02-13 15:39\n#noteEmbedded software:functions in a program;SDK;Python package;Pipeline Lambda;Bundled solution.ML as a Service:Batch ML job;Request/response API;Request/response API;Stream processing job.We generally need to convert a Notebook to Software and then we need to do regression testing (test if performance are not"},{"title":"Architecture component breakdown","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Architecture++++component++++breakdown","shortSummary":"Created: 2023-03-02 11:10\n#quicknoteHigh level architecture:Evaluation layer: it checks the equivalence of two models and it can be used to monitor production models;Scoring layer: it transforms features into predictions (scikit learn is industry standard);Feature layer: it is responsible for generating feature"},{"title":"Challenges for ML Deployment","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Challenges++++for++++ML++++Deployment","shortSummary":"Created: 2023-03-02 10:48\n#quicknoteNOTE: Always keep reproducibility in mind.Several challenges:data dependencies;configuration issues;data and feature preparation;testing -> model errors;ML System Contributors -> how to manage team membersResourcesML Test ScoreSoftware Engineering for MLDeploying ML models in Shadow ModeMonitoring ML Models in productionHidden technical"},{"title":"Course outline","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Course++++outline","shortSummary":"Created: 2023-02-21 11:14\n#quicknoteThis section is (originally) made based on this course from Udemy.IntroDeployment OverviewSystem Architecture: components, challenges, approaches and reproducible pipelinesThe Research Environment: ML pipelineProduction code: from notebooks to production code, testing and production toolsServing Model via REST APIs (FastAPI)Packaging"},{"title":"Feature engineering","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Feature++++engineering","shortSummary":"Created: 2023-03-02 11:46\n#quicknoteVarious problems:missing data;labels -> transform in right format (e.g. from straings to categorical) and deal with high number of labels or rare categories;distribution -> better spread of values may benefit performance;outliers;magnitude -> feature scale can affect some types"},{"title":"ML System Architecture","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__ML++++System++++Architecture","shortSummary":"Created: 2023-02-23 12:01\n#quicknoteDefinition of Architecture: the way software components are arranged and the interactions between them.Tags#ml #course"},{"title":"Model Deployment","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Model++++Deployment","shortSummary":"Created: 2023-02-23 10:58\n#quicknoteProcess of making the model available in prodution.\nChallenges:reliability ->rebustness against errorsreusability -> how easy can be used in other projectsmaintainability -> how easy is to maintain the product in futureflexibility -> how easy is to modify (add/remove) itreproducibility"},{"title":"Pydantic","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Pydantic","shortSummary":"Created: 2023-03-03 14:27\n#quicknotePydantic is used for data validation and settings management using Python type annotations.pydantic enforces type hints at runtime, and provides user friendly errors when data is invalid.Tags#mlops #course #python"},{"title":"Python Packages","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Python++++Packages","shortSummary":"Created: 2023-03-02 17:57\n#quicknoteA module is a file which contains various Python functions and global variables. It is just a file with a .py extension which has python executable code.\nA package is a collection of modules.Tags#python #course"},{"title":"Scikit-learn for feature engineering","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Scikit-learn++++for++++feature++++engineering","shortSummary":"Created: 2023-03-02 15:34\n#quicknoteIt offers a wide range of ML algorithms and data transformations. Most of them follows the same functionality -> it is easy to implement new algorithms.There are three classes of algorithms:Estimators;Transformers;PipelineEstimatorsA class with fit() and predict() methods. It"},{"title":"Serving ML models","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Serving++++ML++++models","shortSummary":"Created: 2023-03-02 10:59\n#quicknoteThere are several optiont to format an ml model:serializing the model with pickle;MLFlow provides a serialization format;language-agnostic exchange format (ONNX, PMML etc).There are various architecture we can consider when deploying an ML model:Embedded approach: a trained model is"},{"title":"Tox","slug":"__Machine++++Learning__MLOps__ML++++Models++++Deployment__Tox","shortSummary":"Created: 2023-03-03 14:13\n#quicknoteTox is a generic virtualenv management and test command line tool.A guide for the config file for tox is here.Tags#mlops #course #python"},{"title":"ML Solutions team members","slug":"__Machine++++Learning__MLOps__ML++++Solutions++++team++++members","shortSummary":"Created: 2023-02-13 11:32\n#noteData scientist -> 20%;Data Engineer -> 30%Software Engineer -> 20%ML Engineer -> 20%MLOps -> 10%Obviously all depends on the budget (tight budget -> search for engineers with multiple skills).\nFocus initially on data engineers and data scientist, add others"},{"title":"Model versioning and registry","slug":"__Machine++++Learning__MLOps__Model++++versioning++++and++++registry","shortSummary":"Created: 2023-02-13 15:18\n#noteML models evolve over time as new training data and different hyperparameters are used.Benefits:linking with training data versions;linking with model hyperparameters;performance improvement analytics;integration and testing;model life cycle managementA model registry is a database containing a model and metadata"},{"title":"Principles of MLOps","slug":"__Machine++++Learning__MLOps__Principles++++of++++MLOps","shortSummary":"Created: 2023-02-13 10:54\n#noteCreate an optimal end-to-end workflow that integrates different teams, modules, tools, and artifacts to continuously improve and deliver machine learning solutions.Principles:modular;reproducible,integrated;continuous;scalable;responsive;automated;observable;transparent;incremental;traceable;collaborative;managed;secure;organized.Requirements are fundamental for the success of a ML project:Non-ML requirements:user experience;solution functions;deployment;scale;security;serviceability;ML requirements:function;performance goals (effectiveness);operational goals (efficiency);cost.ReferencesLinkedInTags#mlops"},{"title":"Technologies","slug":"__Machine++++Learning__MLOps__Technologies","shortSummary":"Created: 2023-02-13 11:34\n#noteStill an evolving field -> lots of tools.Recommendations:decouple tools as much as possible from the main pipelines;choose tools that suits the use case (classical, NLP, vision);test before you buy;if pipelines are third-party based, understand road map and support"},{"title":"Training Pipeline","slug":"__Machine++++Learning__MLOps__Training++++Pipeline","shortSummary":"Created: 2023-02-13 14:32\n#noteA robust managed training pipeline helps to create repeatable ML training and testing workflows while reducing human costs -> useful for traceability, reproducibility, and automation.Functions:get training dataset from feature store;get parameters for training;build and validate model;get test data"},{"title":"Versioning Data","slug":"__Machine++++Learning__MLOps__Versioning++++Data","shortSummary":"Created: 2023-02-13 11:50\n#noteManaging data with a data versioning system provides the ability to change data continuously while ensuring consistent training results and collaboration.Data versioning is a similar concept as code versioning -> it helps track of changes.\nVersions can be at"},{"title":"cnvrg.io workshop","slug":"__Machine++++Learning__MLOps__cnvrg.io++++workshop","shortSummary":"cnvrg.io workshopCreated: 2022-04-26 17:08\n#note\nSpeakers:Omri Bitton;Michael GalarnykCnvrg.ioPlatform to automate training and deployment of AI and ML models, i.e. it manages the entire lifecycle.\nAI Blueprints -> low-code, open-source ML pipelines.\nThey also serve already trained models.\nComparable platforms:Azure ML studioAWS sagemakerGoogle AI Hub\nBut all"},{"title":"Naive Bayes method","slug":"__Machine++++Learning__Naive++++Bayes++++method","shortSummary":"Created: 2023-01-10 10:45\n#noteNaive Bayes classifier is a probabilistic ml model used for classification task.\nIt is based on the Bayes Theorem: $P(A|B)=\\frac{P(B|A)P(A)}{P(B)}$, where B is the evidence and A is the hypothesis.It is called Naive because the assumption that states that"},{"title":"Overfitting","slug":"__Machine++++Learning__Overfitting","shortSummary":"Overfitting is a phenomenon that happens when our model has very good results on the train dataset but not on the test set. We can consider it as when we learn by heart, but we do not really generalize the"},{"title":"PCA","slug":"__Machine++++Learning__PCA","shortSummary":"Created: 2022-12-02 15:32\n#noteIt is a method to reduce the dimensionality of the feature space. In particular, it consists in feature extraction, instead of feature elimination (we drop some features, but we still retain the most valuable parts of all the"},{"title":"Regularization","slug":"__Machine++++Learning__Regularization","shortSummary":"It is a form of regression, that constrains/ regularizes or shrinks the coefficient estimates towards zero. This technique is used to discourage learning a more complex model.Ridge Regression$R=\\lambda \\sum^{p}_{j=1}\\beta_j^2$ is the formula that shows ridge regression, where the loss is modified"},{"title":"Support Vector Machine","slug":"__Machine++++Learning__Support++++Vector++++Machine","shortSummary":"Created: 2023-01-10 11:23\n#noteML model used for linear and non-linear classification, regression, and even outlier detection.In SVM, a data point is viewed as a p-dimensional vector, and we wanted to know whether we can separate such points with a (p-1)-dimensional hyperplane."},{"title":"Types of ML algorithms","slug":"__Machine++++Learning__Types++++of++++ML++++algorithms","shortSummary":"Created: 2023-01-10 10:32\n#noteThere are three main categories of algorithms (but we can combine them):Supervised learning: it consists in inferring a function from labelled training data. Tasks: classification, regression, ranking. Models: SVM, regression, naive Bayes, decision trees, KNN;Unsupervised learning: used to"},{"title":"Validation","slug":"__Machine++++Learning__Validation","shortSummary":"Created: 2022-12-02 15:13\n#noteWe need to create a model with the best settings (the degree), but we don’t want to have to keep going through training and testing. There are no consequences in our example from poor test performance, but in"},{"title":"Accuracy","slug":"__Measures++++and++++metrics__Accuracy","shortSummary":"Created: 2022-03-23 12:28Accuracy is the number of correctly predicted data points out of all the data points. More formally, it is defined as the number of true positives and true negatives divided by the number of true positives, true negatives, false"},{"title":"Churn","slug":"__Measures++++and++++metrics__Churn","shortSummary":"Created: 2022-12-09 15:21\n#noteIt measures how recommendations change when new users are introduced in the system.Tags#recsys"},{"title":"Coherence","slug":"__Measures++++and++++metrics__Coherence","shortSummary":"Created: 2022-09-06 14:38\n#noteTopic Coherence measures score a single topic by measuring the degree of semantic similarity between high scoring words in the topic. These measurements help distinguish between topics that are semantically interpretable topics and topics that are artifacts of"},{"title":"Coverage","slug":"__Measures++++and++++metrics__Coverage","shortSummary":"Three kinds of coverage are considered:Item space coverage: it refers to the extent of items that a recommender system is able to make predictions -> set of items that the RS is capable of working with. There are few metrics"},{"title":"Cross-Entropy","slug":"__Measures++++and++++metrics__Cross-Entropy","shortSummary":"Created: 2023-03-06 09:30\n#quicknoteCross-entropy is a measure of the difference between two probability distributions for a given random variable or set of events.In information theory it is interesting to describe how much information an event contains -> a low probability event"},{"title":"Diversity","slug":"__Measures++++and++++metrics__Diversity","shortSummary":"Diversity means balancing recommendation lists to cover the user's whole set of interests. One way to compute the diversity is using: $div(R_u)= \\sum_{i \\in R_u} \\sum_{j \\in R_u, i!=j}d(i,j)$, where $d(i,j)$ measures the distance between two items (cosine distance can"},{"title":"Entropy","slug":"__Measures++++and++++metrics__Entropy","shortSummary":"Created: 2023-03-06 10:30\n#quicknoteEntropy is the number of bits required to transmit a randomly selected event from a probability distribution. A skewed distribution has a low entropy, whereas a distribution where events have equal probability has a larger entropy.A skewed probability distribution"},{"title":"Hit Rate","slug":"__Measures++++and++++metrics__Hit++++Rate","shortSummary":"Created: 2022-12-09 15:12\n#noteAverage reciprocal hit rate(ARHR) = $\\frac{\\sum^{n}_{i=1} \\frac{1}{rank_i}}{Users}$ -> more attention to top listCumulative hit rate (cHR) -> we should not recommend items that users will not enjoy.Rating hit rate (rHR) -> we should recommend items that users likedReferencesLinkedIn"},{"title":"Jaccard similarity","slug":"__Measures++++and++++metrics__Jaccard++++similarity","shortSummary":"Created: 2022-04-07 18:08\n#note$J(A,B) = \\dfrac {|A \\cap B|}{|A \\cup B|}$ where A and B are sets.ReferencesCodeTags"},{"title":"Kullback-Leibler divergence","slug":"__Measures++++and++++metrics__Kullback-Leibler++++divergence","shortSummary":"Created: 2022-05-19 12:51\n#note[[Statistical distance]] for information theory that quantifies how much one probability distribution differs from another.\nFor discrete probability distributions P and Q defined on the same probability space X, the relative entropy from Q to P is defined as:"},{"title":"Metrics for RS","slug":"__Measures++++and++++metrics__Metrics++++for++++RS","shortSummary":"Created: 2022-03-23 12:22\n#surveyUse validation techniques (k-fold cross validation or leave one out cross validation in case of [[Cold-start]])There are several aspects to consider:[[Accuracy]];[[Similarity]];[[Ranking recommendation metrics]];[[Set recommendation metrics]];[[Diversity metrics]];[[Stability and reliability]];This survey on evaluation methods for RS define 6 concepts for"},{"title":"Mutual Information","slug":"__Measures++++and++++metrics__Mutual++++Information","shortSummary":"Created: 2022-05-06 14:05\n#noteIn probability theory and information theory, the mutual information of two random variables is a measure of the mutual dependence between the two variables, i.e. it quantifies the amount of information obtained about one random variable by observing"},{"title":"Novelty","slug":"__Measures++++and++++metrics__Novelty","shortSummary":"It involves the idea if having novel items in the recommendation. Since there are several definitions for novelty (and so metrics), we can classify it into three levels:Life level novelty -> a recommended item is novel in the life of"},{"title":"Ranking recommendation metrics","slug":"__Measures++++and++++metrics__Ranking++++recommendation++++metrics","shortSummary":"Created: 2022-03-23 12:32Average Precision at k (AP@K) s a measure of the average relevance scores of a set of the top-K recommendations presented. Its formula is $$AP@K = \\dfrac{1}{m}\\sum_{i=1}^{K}P(i)rel(i)$$ where rel(i) is just an indicator that says if the i-th"},{"title":"Responsiveness","slug":"__Measures++++and++++metrics__Responsiveness","shortSummary":"Created: 2022-12-09 15:22\n#noteIt measures how much the system can adapt to new items and users.Tags#recsys"},{"title":"Serendipity","slug":"__Measures++++and++++metrics__Serendipity","shortSummary":"It is related to lucky findings or satisfying surprises. There are two kinds of metrics for serendipity:Primitive recommender based: a first metric is given by: $ser(R_u) = \\sum_{k=1}^{|R_u|}max(R_u[k] - PM_u[k],0)rel(i_k)\\dfrac{count_k(k)}{k}$, where PM is the primitive recommender and rel is a"},{"title":"Similarity","slug":"__Measures++++and++++metrics__Similarity","shortSummary":"Created: 2022-03-23 12:24Word Embedding-Based similarityTo overcome the absence of semantics in the traditional similarity measures\navailable in the state of the art, one can resort to the use of word embeddings to capture conceptual relationships between words. In the word embedding"},{"title":"Stability and reliability","slug":"__Measures++++and++++metrics__Stability++++and++++reliability","shortSummary":"Created: 2022-03-23 12:33Stability -> recommendations that are close in time should not change much after a little amount of time.Reliability -> how much we can trust the recommendation, i.e. we can trust it if an item is recommended because a"},{"title":"Statistical distance","slug":"__Measures++++and++++metrics__Statistical++++distance","shortSummary":"Created: 2022-05-19 12:54\n#noteStatistical distance is the general idea of calculating the difference between statistical objects like different probability distributions for a random variable. One approach consists in calculating the distance between the two distributions, but this can be very challenging."},{"title":"Topic diversity","slug":"__Measures++++and++++metrics__Topic++++diversity","shortSummary":"Created: 2022-09-15 12:38\n#noteRBO (Ranked-Biased Overlap)RBO is based on the concept of overlap at depth h between two lists, which is the number of elements that the lists share when only the first h words are considered. For example, the overlap"},{"title":"Unexpectedness","slug":"__Measures++++and++++metrics__Unexpectedness","shortSummary":"Originally, it was stated as a component of serendipity. It has been defined as divergence from expected recommendations Two sets of metrics have been proposed:Primitive recommender based unexpectedness: unexpectedness can be considered as a deviation from expected recommendations → $unexp(R_u)=R_u"},{"title":"Utility","slug":"__Measures++++and++++metrics__Utility","shortSummary":"It represents the value that users receives in being recommended -> if the user enjoys the recommended items, he/she received useful recommendations. One way to measure utility is by evaluating the rating the user gives to predicted items after consuming"},{"title":"Amazon DSSTNE","slug":"__Miscellaneous__Amazon++++DSSTNE","shortSummary":"Created: 2022-12-23 14:22\n#noteDSSTNE (pronounced \"Destiny\") is an open source software library for training and deploying recommendation models with sparse inputs, fully connected hidden layers, and sparse outputs. Models with weight matrices that are too large for a single GPU can"},{"title":"Apache Spark","slug":"__Miscellaneous__Apache++++Spark","shortSummary":"Created: 2022-12-23 14:02\n#noteFramework designed for distributed computing.Very efficient to distribute computation and scale things up, thanks to a cluster manager that allocates the things to do among executors.Processing is organized using a directed acyclic graph.The main parts of Spark are:driver"},{"title":"Approximate nearest neighbour","slug":"__Miscellaneous__Approximate++++nearest++++neighbour","shortSummary":"Created: 2022-08-23 14:56\n#noteTo search for nearest neighbours we could use two approacehs:Exhaustive search -> comparing each point to every other point;Grid trick -> subdiving the space into a Grid\nThe grid trick requires exponential time/space, so it is unfeasible for high"},{"title":"CCA - A Multi-View Embedding Space for Modeling Internet Images, Tags, and their Semantics","slug":"__Miscellaneous__CCA++++-++++A++++Multi-View++++Embedding++++Space++++for++++Modeling++++Internet++++Images,++++Tags,++++and++++their++++Semantics","shortSummary":"Created: 2022-07-09 11:08\n#paperThis paper investigates the problem of modeling Internet images and associated text or tags for tasks such as image-to-image search, tag-to-image search, and image-totag search (image annotation).Main ideaThe starting point is Canonical correlation analysis (CCA), which is an"},{"title":"Curse of dimensionality","slug":"__Miscellaneous__Curse++++of++++dimensionality","shortSummary":"Created: 2023-02-17 12:08\n#noteThe Curse of Dimensionality refers to the situation when your data has too many features.It can also refer to several other issues like:If we have more features than observations, we have a risk of overfitting the model.When we have too"},{"title":"DevOps","slug":"__Miscellaneous__DevOps","shortSummary":"Created: 2023-02-13 10:44\n#noteIt combines development, test, and operations software into one integrated workflow. It unites people, processes, and technology by using agile principles, best practices, and tools.\nIt enables fast yet methodical software delivery management.\nIt helps to drive continuous evolution and"},{"title":"Fuzzy Matches","slug":"__Miscellaneous__Fuzzy++++Matches","shortSummary":"Created: 2023-03-15 16:56\n#quicknoteA fuzzy match happens when a translator implements a new source text or phrase and it doesn't match one of these “pre-translated” phrases exactly, but is really close.The primary function of fuzzy matching is to assist the translator"},{"title":"Image captioning","slug":"__Miscellaneous__Image++++captioning","shortSummary":"Created: 2023-02-17 11:30\n#noteImage Captioning is the task of describing the content of an image in words. This task lies at the intersection of computer vision and natural language processing. Most image captioning systems use an encoder-decoder framework, where an input image"},{"title":"Manifold Alignment","slug":"__Miscellaneous__Manifold++++Alignment","shortSummary":"Created: 2022-07-07 16:22\n#noteManifold Alignment is a dimensionality reduction problem in which the aim is to map multiple datasets to the same vectorial space.ReferencesTowards Data ScienceCodeTags"},{"title":"Maximal Marginal Relevance","slug":"__Miscellaneous__Maximal++++Marginal++++Relevance","shortSummary":"Created: 2022-07-01 09:43\n#paperMain ideaMMR tries to reduce the redundancy of results while at the same time maintaining query relevance of results for already ranked documents/phrases etc.\nOne approach to reach this could consist in using cosine similarity among the results and"},{"title":"Ranking","slug":"__Miscellaneous__Ranking","shortSummary":"Created: 2022-06-16 18:23\n#noteWhen ranking documents (or, more in general, items), depending on how many of them we consider at a time in the loss, we can define several approaches:Pointwise approach -> one document at a time is considered. The single"},{"title":"Semantic Segmentation","slug":"__Miscellaneous__Semantic++++Segmentation","shortSummary":"Created: 2023-02-17 11:17\n#noteImage segmentation is a computer vision task in which we label specific regions of an image according to what's being shown.\nBecause we're predicting for every pixel in the image, this task is commonly referred to as dense prediction.Applications:Autonomous vehicles;Medical"},{"title":"Translation memories","slug":"__Miscellaneous__Translation++++memories","shortSummary":"Created: 2023-03-15 16:50\n#quicknoteA translation memory is a database that stores sentences, paragraphs or segments of text that have been translated before.Each entry, or segment, in the translation memory includes the original language, known as the \"source\" and its translation, known"},{"title":"Android app","slug":"__Obsidian__Android++++app","shortSummary":"The Android app is now publicly available, and a link to the Play store listing can be found at https://obsidian.md/mobileWhere are my vaults stored?On Android, the Obsidian home folder is stored in the public documents folder under Documents/Obsidian. The public"},{"title":"Credits","slug":"__Obsidian__Credits","shortSummary":"Names are not listed by amount of contribution, but alphabetically (or at least we try!).Dev teamLicat (Shida Li)<span class='flair mod-pop'>Obsidian office cat</span>Silver (Erica Xu)<span class='flair mod-pop'>Team Little Silvers</span>Moderatorsanthonyg (Anthony Gold)<span class='flair mod-pop' style='background-color:#F1C40F;color:#000;'>Team Gold</span><span class='flair mod-pop'>Think Tank</span>argentum<span class='flair mod-pop'>Team Little"},{"title":"Mobile app beta","slug":"__Obsidian__Mobile++++app++++beta","shortSummary":"Public releaseThe mobile apps are now officially publicly available. You can find the download links for the public versions at https://obsidian.md/mobileDocumentationFor more details on how to use Obsidian for Mobile, including guides for setting up sync, see [[Obsidian Mobile]].Insider buildsIf"},{"title":"Obsidian Mobile","slug":"__Obsidian__Obsidian++++Mobile","shortSummary":"Obsidian for AndroidSee [[Android app]].Obsidian for iOSSee [[iOS app]]."},{"title":"Obsidian","slug":"__Obsidian__Obsidian","shortSummary":"What is ObsidianObsidian is a both a Markdown editor and a knowledge base app.Used in the most basic way, you can edit and preview Markdown files. But its true power lies in managing densely networked knowledge base.How do we start"},{"title":"Official website","slug":"__Obsidian__Official++++website","shortSummary":"Obsidian’s official website is at https://obsidian.md/.It’s useful for:Grabbing the latest installer if your [[Installer version]] is too low;Register an account if you want to purchase [[Catalyst license]], [[Commercial license]], [[Obsidian Sync]], or [[Obsidian Publish]];Playing a quiz game if you’re confident"},{"title":"iOS app","slug":"__Obsidian__iOS++++app","shortSummary":"The iOS app is now publicly available, and a link to the app store listing can be found at https://obsidian.md/mobileWhere are my vaults stored?If you choose, you can store your vaults in iCloud Drive. These vaults can be found in"},{"title":"First Meeting","slug":"__Pi++++School__First++++Meeting","shortSummary":"Created: 2023-03-06 13:56\n#quicknoteTags#pischool"},{"title":"Audio recorder","slug":"__Plugins__Audio++++recorder","shortSummary":"Audio recorder is a plugin that lets you make a recording without leaving Obsidian. It's useful for class and meeting notes when you can't catch up for some reason, or for recording important discussions so you don't miss any details.To"},{"title":"Backlinks","slug":"__Plugins__Backlinks","shortSummary":"The backlinks plugin shows how the current note is referenced in other notes.After enabling it, you'll see the backlink count in the status bar.In the right side bar (if it's expanded), you should also see a panel that shows where"},{"title":"Command palette","slug":"__Plugins__Command++++palette","shortSummary":"The Command Palette is enabled by default, as it is a very useful way to access nearly all the features of Obsidian without having to remember key strokes. Type Ctrl/Cmd+P to activate, then simply type in the name of the"},{"title":"Core plugins","slug":"__Plugins__Core++++plugins","shortSummary":"One of the most powerful aspects of [[Obsidian]] is the ability to add new functionality via plugins. It comes with several already, and many more are in development.You can also build your own Obsidian plugin. See [[Community plugins]].Plugins can be"},{"title":"Daily notes","slug":"__Plugins__Daily++++notes","shortSummary":"Daily Notes will create a new note that is automatically named with the current date. If it already exists, it will open that note. This is a useful way to create a daily log, todo list, or a list of"},{"title":"File explorer","slug":"__Plugins__File++++explorer","shortSummary":"The File explorer shows [[Accepted file formats|the list of files Obsidian can recognize]] in your vault. You can open notes, [[create notes]] and folders, and [[rename notes]] in it. Right clicking on a note or directory in the File explorer"},{"title":"File recovery","slug":"__Plugins__File++++recovery","shortSummary":"File recovery is a core plugin to help you recover your data in case of all kind of accidents - user error, power outage, or misbehaving plugins and scripts.File recovery is default to enabled, because it's too late to enable"},{"title":"Graph view","slug":"__Plugins__Graph++++view","shortSummary":"Shows a graph representation of the [[Internal link|internal links]] between your notes.Notes with more notes referencing it appear as bigger nodes on the graph.![[Pasted image 10.png]]Visualization tipsYou can hover each node to highlight its connections, fading everything else.You can drag"},{"title":"Markdown format converter","slug":"__Plugins__Markdown++++format++++converter","shortSummary":"It allows you to convert from other variations of Markdown format and link convention to Obsidian format.Right now you can convert:Roam #tags to [[tags]]Roam ^^highlight^^ to ==highlight==Bear ::highlight:: to ==highlight==.Zettelkasten [[UID]] links to full links [[UID File Name]]Zettelkasten [[UID]] links"},{"title":"Note composer","slug":"__Plugins__Note++++composer","shortSummary":"The Note composer plugin allows you to easily merge two note or extract part of a note into its own note.MergeWhen working with the file, you can choose \"Merge entire file with...\" in the More Options menu.Alternatively, you can open"},{"title":"Open in default app","slug":"__Plugins__Open++++in++++default++++app","shortSummary":"Opens the current file with default app on your computer. You can access it at the top right corner of the file top bar:![[Pasted image 5.png]]It's useful for editing images or annotating PDFs, among other things."},{"title":"Outgoing links","slug":"__Plugins__Outgoing++++links","shortSummary":"The Outgoing Links plugin shows the links from the current note at a glance, as well as potential links to be made. If you're familiar with the [[Backlinks]] plugin, you can think of outgoing links as the opposite direction of"},{"title":"Outline","slug":"__Plugins__Outline","shortSummary":"The outline plugin shows the list of headings for the current note, and allows you to navigate to another section by clicking on a heading."},{"title":"Page preview","slug":"__Plugins__Page++++preview","shortSummary":"Page preview lets you preview a page when hovering an internal link, without needing to actually navigate to that page.![[Pasted image 13.png]]This works on the preview pane. In the editor, you can hover a link while holding Ctrl/Cmd, which will"},{"title":"Publish","slug":"__Plugins__Publish","shortSummary":"The Publish plugin lets you publish notes from your vault onto your site, all from within the Obsidian app.For more information about the Obsidian Publish™ service, what's included, how it works, and privacy, see the [[Obsidian Publish]] add-on service.Enable the"},{"title":"Quick switcher","slug":"__Plugins__Quick++++switcher","shortSummary":"The Quick switcher lets you jump to other notes without leaving your keyboard. The shortcut to invoke it is Ctrl/Cmd+O. Just start typing, and matching filenames will be selected. Use up and down arrows to navigate the results, Enter to"},{"title":"Random note","slug":"__Plugins__Random++++note","shortSummary":"Random note does just that, opens a note at random from your Vault. Many people find this useful for surfacing thoughts they had not considered in a long time, or spot checking for things that they may have forgotten to"},{"title":"Search","slug":"__Plugins__Search","shortSummary":"![[Search.png]]Search is a powerful feature, and has the potential to be confusing. In most cases, if you just type what you want to find, it will work. But search has many capabilities for narrowing down to find exactly what you"},{"title":"Slides","slug":"__Plugins__Slides","shortSummary":"Slides lets you do simple presentations right inside Obsidian.Usage tipsTo separate slides, use newlines and the --- separator.To start a presentation, click this button after opening a note:![[Pasted image 14.png]]DemoCheck out the demo document: [[Slides demo]]"},{"title":"Starred notes","slug":"__Plugins__Starred++++notes","shortSummary":"Starred notes are a convenient way of keeping important notes close at hand. Enabling the plugin will create a star icon on the left panel, which brings up a list of starred notes.To star a file, you have several options."},{"title":"Tag pane","slug":"__Plugins__Tag++++pane","shortSummary":"Adds a panel on the right that displays all the tags you have, along with their tag count.When clicking on a tag, a search for the tag is activated. To ==toggle a tag== in search, Ctrl-click it instead.SortingThe tags are"},{"title":"Templates","slug":"__Plugins__Templates","shortSummary":"The Templates plugin lets you quickly insert snippets of text into your current note.Set up template folderEach template snippet is just a normal Markdown note, like everything else in Obsidian.To designate template files, put them into a folder, and choose"},{"title":"Word count","slug":"__Plugins__Word++++count","shortSummary":"Word count is a simple plugin that shows the word count of your current note in the bottom status bar.It works for CJK characters too (Chinese, Japanese, and Korean), in which words are not separately by spaces but rather glued"},{"title":"Workspaces","slug":"__Plugins__Workspaces","shortSummary":"The Workspaces plugin lets you save and load \"workspaces\". Each workspace includes pane layout, sidebar state (expanded or collapsed), and file open states.![[Pasted image 19.png]]Save a workspaceEither click on the workspace icon in the ribbon to open \"Manage workspaces\".Give the"},{"title":"Zettelkasten prefixer","slug":"__Plugins__Zettelkasten++++prefixer","shortSummary":"Adds a new button to the left pane, which can be used to create a new file and prefix it for you using the current time. This can be beneficial if you are a follower of the Zettelkasten UID-in-filename method.The"},{"title":"Cold-start","slug":"__Recommender++++Systems__Cold-start","shortSummary":"Created: 2022-03-23 11:55\n#noteThis problem occurs when it is impossible to make valid recommendations due to an initial lack of ratings.Types:new community -> not enough data (for example in a new RS system) -> it occurs in [[Collaborative filtering]] systems ->"},{"title":"Collaborative filtering","slug":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering","shortSummary":"Created: 2022-03-22 14:51Based on information provided by users that have the most in common with the targeted user. To do so we need enough information -> [[Content-based filtering]] filtering is better for now.Referenceshttps://dl.acm.org/doi/pdf/10.1155/2009/421425https://developers.google.com/machine-learning/recommendation/collaborative/basicshttps://it.wikipedia.org/wiki/Collaborative_filteringhttps://towardsdatascience.com/introduction-to-recommender-systems-1-971bd274f421Tags#collaborative_filtering"},{"title":"Matrix factorization","slug":"__Recommender++++Systems__Collaborative++++Filtering__Matrix++++factorization","shortSummary":"Created: 2022-04-25 11:25\n#noteIt consists in a representation of user-item as a vector of latent features which are projected into a shared feature space. User-item interactions are modeled using inner product of user-item latent vectors.\nIt can be enhanced by integrating it"},{"title":"Memory-based methods","slug":"__Recommender++++Systems__Collaborative++++Filtering__Memory-based++++methods","shortSummary":"Created: 2022-03-23 11:45[[Collaborative filtering]] methods act only on the matrix of user ratings for items and use ratings obtained before the referral process.\n[[Similarity]] metrics are use to compute the distance between two users or items.Referenceshttps://www.sciencedirect.com/science/article/pii/S0950705113001044Tags#memory_based"},{"title":"Model-based methods","slug":"__Recommender++++Systems__Collaborative++++Filtering__Model-based++++methods","shortSummary":"Created: 2022-03-23 11:47[[Collaborative filtering]] methods that use RS information to create a model that generates recommendations, i.e. any new data outdates the model.\nExamples: #bayesian_network, #neural_network, #fuzzy_genetic, #genetic_algorithm, #latent_features, #matrix_factorizationReferenceshttps://www.sciencedirect.com/science/article/pii/S0950705113001044Tags#model_based"},{"title":"kNN","slug":"__Recommender++++Systems__Collaborative++++Filtering__kNN","shortSummary":"Created: 2022-03-23 11:35[[Collaborative filtering]] method based on [[Similarity]] measures.\nSimple and quite accurate, but suffers of low scalability and has problems in case of sparse databases -> not good for [[Cold-start]].User to user approach:using the selected similarity measure, we produce a"},{"title":"Content-based filtering","slug":"__Recommender++++Systems__Content++++based__Content-based++++filtering","shortSummary":"Created: 2022-03-22 21:31Suggest similar items based on user choices made in the past and item metadata.Referenceshttps://developers.google.com/machine-learning/recommendation/content-based/basicshttps://towardsdatascience.com/introduction-to-recommender-systems-1-971bd274f421Tags#content_based"},{"title":"Cross Domain RS","slug":"__Recommender++++Systems__Cross++++Domain++++RS","shortSummary":"Created: 2022-03-24 16:54Cross domain recommender systems assists taget domain by using knowledge learned from other domains -> thi scould resolve #sparsity and #cold_start problems.Referenceshttps://arxiv.org/pdf/1707.07435.pdfTags#cross_domain"},{"title":"DL models","slug":"__Recommender++++Systems__DL++++models","shortSummary":"Created: 2022-03-23 12:53Pros:they can deal with non linear transformations;good for sequence modeling, next basket recommendation or session based recommendations (for example #click-logs);representation learning [[Autoencoder]] [[Restricted Boltzmann machine(RBM)]];easier to build hybrid systemsCons:interpretability -> black boxes;they need a big amount of data;hyperparameter"},{"title":"Demographic filtering","slug":"__Recommender++++Systems__Demographic++++Filtering__Demographic++++filtering","shortSummary":"Created: 2022-03-23 11:31Individual with certain common personal attributes will have common preferences. Use age, genre, nationality etcReferencesTags#demographic_filtering"},{"title":"Feedback","slug":"__Recommender++++Systems__Feedback","shortSummary":"Created: 2022-03-23 12:37\n#noteExplicit feedback -> user's characteristicsImplicit feedback -> data is obtained from user's interaction with the app. Advantage: is easier to collect. Drawback: no readily available negative feedback.Take in consideration that there is always a certain amount of bias"},{"title":"How to use textual data","slug":"__Recommender++++Systems__How++++to++++use++++textual++++data","shortSummary":"Created: 2022-03-29 10:47\n#note[[Embedding-based News Recommendation for Millions of Users]]Use text to infer ratings of users, distinctive aspects of an item, user's sentiment about an item, extract context attributes (user was in company or alone during an experience, occasion of the"},{"title":"Hybrid Filtering","slug":"__Recommender++++Systems__Hybrid++++Filtering__Hybrid++++Filtering","shortSummary":"Created: 2022-03-23 11:37Used in combination of [[Collaborative filtering]] with [[Demographic filtering]] or [[Collaborative filtering]] with [[Content-based filtering]] to exploit merits of each one of these techniques.Often based on bioinspired or probabilistic methods -> #genetic_algorithm, #fuzzy_genetic, #neural_network, #bayesian_network, #clustering, #latent_features![[hybrid_architecture.jpg]]Referenceshttps://www.sciencedirect.com/science/article/pii/S0950705113001044Tags#hybrid_filtering"},{"title":"Multi-task learning","slug":"__Recommender++++Systems__Multi-task++++learning","shortSummary":"Created: 2022-03-24 16:59By sharing representations between related tasks, we can enable our model to generalize better on our original task.\nThis can also help to avoid overfitting by generalizing the shared hidden representations, it can somehow help in the explanation od"},{"title":"Multilayer Perceptron","slug":"__Recommender++++Systems__Multilayer++++Perceptron","shortSummary":"Created: 2022-03-24 11:52This category of #dl models can be used to add nonlinearity to existing RS approaches.Papers:[[Neural Collaborative Filtering]];[[Deep Factorization Machine]][[Wide & Deep Learning]] ;[[Deep Structured Semantic Model]];Referenceshttps://arxiv.org/pdf/1707.07435.pdfTags#mlp"},{"title":"Neural Collaborative Filtering","slug":"__Recommender++++Systems__Neural++++Collaborative++++Filtering","shortSummary":"Created: 2022-03-24 12:03\n#paperMain idea[[Multilayer Perceptron]] Technique based on #neural_network  to tackle [[Collaborative filtering]] 's problems on basis of implicit feedback.\nTo improve performances pairwise ranking loss can be used.One of the most used variation of Collaborative filtering is [[Matrix factorization]],"},{"title":"PinnerSage - Multi-Modal User Embedding Framework for Recommendations at Pinterest","slug":"__Recommender++++Systems__PinnerSage++++-++++Multi-Modal++++User++++Embedding++++Framework++++for++++Recommendations++++at++++Pinterest","shortSummary":"Created: 2022-07-04 09:54\n#paperMain ideaIn this work, the authors postulate that a single embedding is not sufficient for encoding multiple facets of a user’s interests that might have no obvious linkage between them. They can evolve, with some interests persisting long"},{"title":"BERT4Rec","slug":"__Recommender++++Systems__Sequential++++RS__BERT4Rec","shortSummary":"Created: 2022-06-20 17:23\n#paperMain ideaBERT4Rec is a lot like regular BERT for NLP. In this case the Transformer network is trained to predict masked items (Cloze Task) from a user’s history. Then, the self-attention is what allows this architecture to model"},{"title":"Chameleon","slug":"__Recommender++++Systems__Sequential++++RS__Chameleon","shortSummary":"Created: 2022-06-14 11:15\n#paperMain ideaChameleon is an [[Hybrid Filtering]] Meta-Architecture for personalized news recommendations that deals with Deep [[Sequential RS]]/aware RS and Deep feature extraction from heterogeneous data.Problems with RS on news:sparse user profiling -> majority of users are anonymous, so"},{"title":"CoSeRNN","slug":"__Recommender++++Systems__Sequential++++RS__CoSeRNN","shortSummary":"Created: 2022-06-24 09:30\n#paperMain ideaIn music recommendations that are several challenges that are different to the ones we can encounter in other fields -> tracks are short, listened to multiple times, tipically consumed in sessions with other tracks and relevance is"},{"title":"JODIE-Predicting Dynamic Embedding Trajectory in Temporal Interaction Networks","slug":"__Recommender++++Systems__Sequential++++RS__JODIE-Predicting++++Dynamic++++Embedding++++Trajectory++++in++++Temporal++++Interaction++++Networks","shortSummary":"Created: 2022-06-29 09:29\n#paperMain ideaJODIE is a coupled recurrent neural network model that learns the embedding trajectories of users and items. The embeddings of the user and the item are updated when a user takes an action and a projection operator"},{"title":"NxtPost - User to Post Recommendations in Facebook Groups","slug":"__Recommender++++Systems__Sequential++++RS__NxtPost++++-++++User++++to++++Post++++Recommendations++++in++++Facebook++++Groups","shortSummary":"Created: 2022-06-19 08:37\n#paperMain ideaNxtPost is a user-to-post [[Content-based filtering]] [[Sequential RS]] for Facebook Groups that uses a [[Transformer]]-based model. Causal masked multi-head attention is used to optimize both short and long-term user interests. Recommendable posts can have a corpus of"},{"title":"Sequential RS","slug":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","shortSummary":"Created: 2022-06-14 11:25\n#noteSequential RSs try to understand and model the sequential user behaviors, the interactions between users and items, the evolution of users' preferences and item popularity over time. This means that SRs take the prior sequential interactions as a"},{"title":"Social information","slug":"__Recommender++++Systems__Social++++information","shortSummary":"Created: 2022-03-23 11:41To enhance performances of the recommendation system:#trust:user trust->based on other users or implicit info;item trust-> based on feedback from users or on how users interact with items;#folkonomies:to create tag recommendation systems;to enrich recommendation processes using tags;#social_filtering -> creation"},{"title":"Surpriselib","slug":"__Recommender++++Systems__Surpriselib","shortSummary":"Created: 2022-12-12 14:15\n#noteIt is one of the most famous libraries for RecSys.It has a base class, AlgoBase, which is divided into 4 categories of algorithms:SVD;KNNBasic;SVDpp;CustomReferencesSurpriseLInkedin Course on RecSysCodeGitHubTags#library"},{"title":"Text-based collaborative filtering for cold-start soothing and recommendation enrichment","slug":"__Recommender++++Systems__Text-based++++collaborative++++filtering++++for++++cold-start++++soothing++++and++++recommendation++++enrichment","shortSummary":"Created: 2022-03-29 11:43\n#paperMain ideaThe main idea behind this paper is to build a unified vector space where both users and items are mapped. In this way similar items and users are mapped close together (if they use similar words), so"},{"title":"SQL Constraints","slug":"__SQL__SQL++++Constraints","shortSummary":"Created: 2023-02-16 13:02\n#noteSQL constraints are used to specify rules for the data in a table.Constraints are used to limit the type of data that can go into a table. This ensures the accuracy and reliability of the data in the"},{"title":"SQL JOIN","slug":"__SQL__SQL++++JOIN","shortSummary":"Created: 2023-02-15 12:23\n#noteA JOIN clause is used to combine rows from two or more tables, based on a related column between them. Example:SELECT Orders.OrderID, Customers.CustomerName, Orders.OrdersDate\nFROM Orders JOIN Customers ON Orders.CstomersID=Customers.CustomerIDThere are different types of the JOINs in SQL:(INNER) JOIN: Returns records"},{"title":"SQL Stored Procedures","slug":"__SQL__SQL++++Stored++++Procedures","shortSummary":"Created: 2023-02-15 15:47\r\n#noteA stored procedure is a prepared SQL code that you can save, so the code can be reused over and over again.So if you have an SQL query that you write over and over again, save it as"},{"title":"SQL Syntax","slug":"__SQL__SQL++++Syntax","shortSummary":"Created: 2023-02-15 11:34\r\n#noteINTROA database most often contains one or more tables. Each table is identified by a name (e.g. \"Customers\" or \"Orders\"). Tables contain records (rows) with data..Most of the actions made on a database are done with SQL statement.NOTE:"},{"title":"SQL Views","slug":"__SQL__SQL++++Views","shortSummary":"Created: 2023-02-16 13:05\n#noteA view is a virtual table based on the result-set of an SQL statement.\nYou can add SQL statement and functions to a view and present the data if the data were coming from one single table.CREATE VIEW view_name"},{"title":"Start here","slug":"__Start++++here","shortSummary":"Hi there! I'm a note in your vault.At the same time, I'm also just a Markdown file sitting on your hard disk. It's all in plain text, so you don't need to worry about losing me in case [[Obsidian]] disappears"},{"title":"Agenda Template","slug":"__Templates__Agenda++++Template","shortSummary":"{{title}}Created: {{date}} {{time}}\n#agendaGoalsThoughtsAction items[ ]"},{"title":"Note Template","slug":"__Templates__Note++++Template","shortSummary":"Created: {{date}} {{time}}\n#noteReferencesCode"},{"title":"Paper Template","slug":"__Templates__Paper++++Template","shortSummary":"Created: {{date}} {{time}}\r\n#paperMain ideaResultsIdeas for future worksIn deepReferencesCodeTags"},{"title":"Quick Note Template","slug":"__Templates__Quick++++Note++++Template","shortSummary":"Created: {{date}} {{time}}\n#quicknoteTags"},{"title":"TO-DO Template","slug":"__Templates__TO-DO++++Template","shortSummary":"TO-DO TemplateCreated: 2022-04-01 09:05\n#to-doGoalsAction items[ ]"},{"title":"Autoencoding variational inference for topic models","slug":"__Topic++++Modelling__Autoencoding++++variational++++inference++++for++++topic++++models","shortSummary":"Created: 2022-05-09 12:13\n#paperA major problem with classic topic model methods is that any change to the topic model requires mathematically deriving a new inference algorithm. Autoencoding variational inference for topic model (AVITM) tackles this problems and matches traditional methods in"},{"title":"BERTopic","slug":"__Topic++++Modelling__BERTopic","shortSummary":"Created: 2022-05-03 09:08\n#paperThe firsts #topic_modeling  approaches used bag-of-words representations to create topics, but this method has the limit that they do not consider the semantic relationships among words. As an answer to this issue, text embedding techniques became popular"},{"title":"Clusters on word embeddings","slug":"__Topic++++Modelling__Clusters++++on++++word++++embeddings","shortSummary":"Tired of Topic Models? Clusters of Pretrained Word Embeddings Make for Fast and Good Topics too!Created: 2022-05-04 13:58\n#paperMain ideaClustering pretrained word embeddings while incorporating document information for weighted clustering and reranking top words. Results obtained with this method are comparable"},{"title":"Collaborative Topic Modeling","slug":"__Topic++++Modelling__Collaborative++++Topic++++Modeling","shortSummary":"Created: 2022-05-03 10:41\n#paperMain ideaCollaborative Topic Modeling (CTM) is a recommender system for text-based items buildt upon Probabilistic Matrix Factorization (PMF) and [[LDA]].CTM is superior compared to PMF approach because it is able to do out-of-matrix predictions, i.e. it can derive"},{"title":"Combined Topic Modelling","slug":"__Topic++++Modelling__Combined++++Topic++++Modelling","shortSummary":"Pre-training is a Hot Topic, Contextualized Document Embeddings improve Topic CoherenceCreated: 2022-05-09 11:49\n#paperIn this paper the authors combine contextualized representations with neural topic models. This improves topic coherence in a significant way. The model is called Combined Topic Model (CTM).\nThe"},{"title":"Concept","slug":"__Topic++++Modelling__Concept","shortSummary":"Created: 2022-07-01 08:50\n#note\n![[Concept_model.png]]Steps:Both images an documents are both embedded into the same vector space using OpenAI's CLIP model;Using [[UMAP]]+[[HDBSCAN]] the image embeddings are clustered to create clusters of visually and semantically similar images. Clusters are called concepts;To pick representative images"},{"title":"LDA","slug":"__Topic++++Modelling__LDA","shortSummary":"Created: 2022-05-03 09:59\n#note\n \nLDA is a Bayesian version of [[PLSA]].Latent Dirichlet Allocation works as follow:Specify the number of topics;Each word is randomly assigned to one of the topics (technically the distribution is a Dirichlet one, i.e. the numbers of assigned across"},{"title":"LSA","slug":"__Topic++++Modelling__LSA","shortSummary":"Created: 2022-05-09 15:54\n#noteLatent Semantic Analysis is a method for topic modelling whose algorithm can be described as follows:Convert the text corpus into a document-term matrix;Implement truncated singular value decomposition;Encode the words/documents with the extracted topicsStep 1 is done with TF-IDF.\nStep"},{"title":"PLSA","slug":"__Topic++++Modelling__PLSA","shortSummary":"Created: 2022-05-09 16:08\n#noteProbabilistic Latent Semantic Analysis (PLSA) uses a probabilistic method instead of SVD to tackel [[LSA]]'s problems.\nThe core idea is to find a probabilistic model with latent topics that can generate the data we observe in our document-term matrix. In particular,"},{"title":"2nd phase","slug":"__Topic++++Modelling__Thesis__2nd++++phase","shortSummary":"2nd phaseCreated: 2022-06-11 10:14\r\n#noteNew features:users actions are profiled;initial questions to define 80 different types of users (distinction on two levels) -> we already have an initial list of recommended items.Will the user be able to follow/be friends with other users"},{"title":"AWS","slug":"__Topic++++Modelling__Thesis__AWS","shortSummary":"AWSCreated: 2022-04-14 10:24\r\n#noteLaunch recommendation algorithm:\r\npython main.py date=04APR-032 recDatasets:kuriu-analysis-2022-04APR-02.jsonkuriu-comments-2022-04APR-02.jsonkuriu-likes-2022-04APR-02.jsonWeb analysis:\r\nhttps://d3i0te39jl2tog.cloudfront.net/viz-2022-04APR-02-c13/cluster_4.htmlaws s3 ls s3://kuriu-dataset\r\naws s3 cp s3://kuriu-dataset/filekuriu-schede-2022-06JUN-18.json\r\nkuriu-likes-2022-06JUN-18.json\r\nkuriu-recommend-2022-06JUN-18.jsonReferencesAWS CLICLI with DockerCodeTags"},{"title":"Background for Topic Modeling","slug":"__Topic++++Modelling__Thesis__Background++++for++++Topic++++Modeling","shortSummary":"Background for Topic ModelingCreated: 2022-09-12 10:35\r\n#noteThis section of the paper is going to be divided in two sub-sections:Terms and concepts in Topic modeling;Literature reviewTerms and conceptsConcepts:[[Topic modelling]];Document;Word;Vocabulary;Topic;[[Evaluate Clustering]]Terms:BoW -> efficient but does not consider order or semantic meaning;TF-IDF;Embeddings;Transformers;Describe concepts in"},{"title":"Bibliography for our results","slug":"__Topic++++Modelling__Thesis__Bibliography++++for++++our++++results","shortSummary":"Bibliography for our resultsCreated: 2022-09-24 15:21\r\n#noteNot persistent results[[BERTopic]] and [[Top2Vec]] do not offer the possibility to fix the seed number to reproduce results.In BERTopic paper, the results are obtained in the following way: fixed number of topics (from 10 to"},{"title":"Doubts","slug":"__Topic++++Modelling__Thesis__Doubts","shortSummary":"DoubtsCreated: 2022-03-23 16:04\r\n#noteProblems/doubts: #doubtDistribution of user's activity (how many are active, i.e they post regularly or at least like other posts); [[Users]]too few likes? [[Posts]] [[Cold-start]];which categories receive more views  and/or likes? [[Posts]]how to use images? And, more importantly,"},{"title":"Feature Engineering","slug":"__Topic++++Modelling__Thesis__Feature++++Engineering","shortSummary":"Feature EngineeringCreated: 2022-03-31 15:46\r\n#noteFeature engineering:geographic feature -> consider if post is about experience in Italy, Europe or reast of the world, so that if a user liked or posted about experiences in Italy (for example), he will receive recommendations about"},{"title":"Ideas","slug":"__Topic++++Modelling__Thesis__Ideas","shortSummary":"IdeasCreated: 2022-03-28 10:42\r\n#noteMy RecSys could work in the following way:documents and pictures are embedded using [[Data2Vec - A General Framework for Self-supervised Learning in Speech, Vision and Language]];User embedding is obtained using data2vec on the history of liked and/or created"},{"title":"My Sequential RS","slug":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","shortSummary":"My Sequential RS^781da5Created: 2022-06-23 09:24\r\n#noteGoal: provide recommendations based on both short-term and long-term preferences -> use two different models or just one?[[BERT4Rec]] is really good for short-term recommendations.\r\n[[NxtPost - User to Post Recommendations in Facebook Groups]] is able to consider"},{"title":"Notes on Cluster RS","slug":"__Topic++++Modelling__Thesis__Notes++++on++++Cluster++++RS","shortSummary":"Notes on Cluster RSCreated: 2022-03-31 15:36\r\n#noteHow to build clusters:just use all the posts and the features;divide by category and then cluster for each of them -> I have to weight both the common category and the common cluster.[[Cluster Consensus]]ApproachesTwo approaches"},{"title":"Paper review TO-DO","slug":"__Topic++++Modelling__Thesis__Paper++++review++++TO-DO","shortSummary":"Paper review TO-DOCreated: 2022-08-08 09:05\r\n#to-doGoalsBe on the same page with Maryam about the approaches used and the metrics used to evaluate the approaches.Action items[x] WEClustering with sentence transformer and HDBSCAN: BERT with sentence transformer -> I think that the mothod"},{"title":"Paper's Sections","slug":"__Topic++++Modelling__Thesis__Paper's++++Sections","shortSummary":"Paper's SectionsCreated: 2022-09-12 14:07\n#note2) BackgroundTopic modeling methods can be applied to a great variety of fields and data types, including information retrieval (paper), bioinformatics (review) and topic discovery in images (paper). Our work focuses on approaches that can be used"},{"title":"Problems with Easytour data","slug":"__Topic++++Modelling__Thesis__Problems++++with++++Easytour++++data","shortSummary":"Problems with Easytour dataCreated: 2022-08-08 11:27\n#noteTO-DO:Try to implement [[CoSeRNN]] and see if the amount of data we have is enough;Try to enlarge the data:scrape data -> TripAdvisor has reviews of experiences which could receive the \"Helpful\" vote. Pros: I could"},{"title":"Random notes on clustering","slug":"__Topic++++Modelling__Thesis__Random++++notes++++on++++clustering","shortSummary":"Random notes on clusteringCreated: 2022-05-21 17:36\n#note[[Top2Vec]] embedds documents and words together. Document are assigned to a single topic;[[BERTopic]] embedds documents, reduces the dimensionality and clusters documents. Then it uses TF-IDF to extract topic representation from each cluster. Documents are assigned"},{"title":"DBSCAN","slug":"__Topic++++Modelling__Thesis__Results__DBSCAN","shortSummary":"DBSCAN does not work for any method (TF-IDF, embeddings and Declutr) -> all the points are considered as noise.I tried with several values for $\\epsilon$ (from 0.001 to 0.5) and also with small values for the minimum amount of points"},{"title":"K-means","slug":"__Topic++++Modelling__Thesis__Results__K-means","shortSummary":"Using preprocessed dataTF-IDFNumber of clusters = 5SVD\r\n![[kmeans_tfidf_svd.PNG]]\r\nElbow\r\n![[kmeans_tfidf_elbow.PNG]]\r\nSilhouette Plot\r\n![[kmeans_tfidf_5clusters_silhouette.png]]Inter cluster distance\r\n![[kmeans_tfidf_5clusters_interdistance.png]]Intra cluster distance:\r\nIntra cluster distances for topic 1:\r\nComplete Diameter Distance: 5723.0\r\nAverage Diameter Distance: 1984.8232931760856\r\nCentroid Diameter Distance: 464325.3520435619Intra cluster distances for topic 3:\r\nComplete Diameter Distance: 5701.0\r\nAverage Diameter Distance: 2343.49103021331\r\nCentroid Diameter Distance: 420402.24528022745Intra"},{"title":"Various results","slug":"__Topic++++Modelling__Thesis__Results__Various++++results","shortSummary":"Various resultsCreated: 2022-08-17 16:09\r\n#noteEasytourLDARaw data: (LDA does not deal with stop words so we have to preproecss data)\r\nNumber of topics ->\r\nDiversity ->\r\nNPMI ->\r\nUCI ->\r\nUMASS ->\r\nC_V ->Processed data:\r\nNumber of topics -> 20\r\nDiversity -> 0.088\r\nNPMI -> -0.004\r\nUCI -> -0.06\r\nUMASS -> -1.65\r\nC_V ->"},{"title":"WEClustering","slug":"__Topic++++Modelling__Thesis__Results__WEClustering","shortSummary":"Preprocessed data2000 documentsElbow for topics discovery\r\n![[WEClustering_words_emb_clustering.PNG]]Elbow on final clustering\r\n![[WEClustering_CD_matrix_clustering.PNG]]SVD\r\n![[WEClustering_plot.PNG]]Silhouette\r\n![[WEClustering_silhouette.PNG]]Inter Cluster Distance\r\n![[WEClustering_interdistance.PNG]]Intra Cluster DistanceIntra cluster distances for topic 0:\r\nComplete Diameter Distance: 1999.0\r\nAverage Diameter Distance: 698.2844360902255\r\nCentroid Diameter Distance: 3982.728611467601Intra cluster distances for topic 2:\r\nComplete Diameter Distance: 1993.0\r\nAverage Diameter Distance: 621.6203680981595\r\nCentroid Diameter Distance:"},{"title":"Study topic parameters","slug":"__Topic++++Modelling__Thesis__Study++++topic++++parameters","shortSummary":"Study topic parametersCreated: 2022-09-06 14:21\n#noteInvestigate how language affects results\nmultiple plots for the datasets (one figure for datasets, composed by multiple plots):\nx-axis techniques\ny-axis value of a scoreOR (one figure for score, composed by multiple datasets)x-axis technique\ny-axisTO-DOs:[x] Investigate number of topics (elbow"},{"title":"Thoughts on results","slug":"__Topic++++Modelling__Thesis__Thoughts++++on++++results","shortSummary":"Thoughts on resultsCreated: 2022-09-07 11:03\n#noteResults for each modelMetrics scores for easytour:LDA -> topic diversity decreases when the number of cluster is bigger and has better results if we consider 10 words for each topic instead of 25, coherence is not"},{"title":"Top2Vec","slug":"__Topic++++Modelling__Top2Vec","shortSummary":"Created: 2022-04-29 16:53\n#paperTop2Vec is an algorithm for topic modeling and semantic search. It can automatically detect topics present in documents and generates jointly embedded topics, documents, and word vectors.\nOnce trained it can:(Automatically) Get number of detected topics.Get topics.Get topic sizes.Get"},{"title":"Topic Modeling in Embedding Spaces","slug":"__Topic++++Modelling__Topic++++Modeling++++in++++Embedding++++Spaces","shortSummary":"Created: 2022-08-18 17:04\n#paperMain ideaETM marries [[LDA]] and word embeddings. It is particularly suited for large and heavy-tailed vocabularies.In deepConsider a corpus of D documents and a vocabulary V. Let $w_{dn} \\in {1,...,V}$ denote the $n^{th}$ word in the $d^{th}$ document.ETM"},{"title":"Topic Modelling Meets Deep Neural Networks - A Survey","slug":"__Topic++++Modelling__Topic++++Modelling++++Meets++++Deep++++Neural++++Networks++++-++++A++++Survey","shortSummary":"Created: 2022-05-19 11:11\n#paper #surveyMain ideaSurvey on neural [[Topic modelling]] (NTM).Historically the most used topic modelling techniques were Bayesian probabilistic topic models (BPTM), with [[LDA]] as the most know representative. In BPTM models topics are caught by latent variables sampled from"},{"title":"Topic modelling","slug":"__Topic++++Modelling__Topic++++modelling","shortSummary":"Created: 2022-05-03 09:13\n#noteText analysis method that analyzes \"bags\" of words together, instead of counting them individually, in order to capture how the meaning of words is dependent upon the broader context in which they are used in natural language.\nThe idea"},{"title":"Vault switcher","slug":"__User++++interface__Vault++++switcher","shortSummary":"Vault switcher lets you switching between existing vaults and create new vaults.Open vault switcherTo open the vault switcher, click on the vault icon at the bottom group of the [[Ribbon]] actions. The tooltip text should say “Open another vault”.You can"},{"title":"Linked pane","slug":"__User++++interface__Workspace__Panes__Linked++++pane","shortSummary":"Panes can be linked together. This has two main effects:By default, when opening a new [[Preview and edit modes|preview pane]] from an editing pane, the new pane is linked to the old one. This means that any changes you make"},{"title":"Pane layout","slug":"__User++++interface__Workspace__Panes__Pane++++layout","shortSummary":"One of the things that makes [[Obsidian]] different from other note-taking apps is how easy it is to open multiple files in your preferred configuration.The window a file gets opened in is what we call a \"pane\". You can have"},{"title":"Ribbon","slug":"__User++++interface__Workspace__Ribbon","shortSummary":"The ribbon is a space for common commands that occupies the vertical space at the very left of the interface. It’s part of the left [[Sidebar]] and is always visible, even if the left sidebar is closed.ActionsEach action is presented"},{"title":"Sidebar","slug":"__User++++interface__Workspace__Sidebar","shortSummary":"Obsidian has two sidebars on both left and right. The left sidebar includes the [[Ribbon]].Open hidden sidebarsIf a sidebar collapsed, you can open it by clicking on the Arrow icon to expand it.This commonly happens when you enable a plugin"},{"title":"Status bar","slug":"__User++++interface__Workspace__Status++++bar","shortSummary":"The status bar shows handy information. That include helpful information about the current file, the current vault, or the current status like time and date.Status items are added both by [[Core plugins|core plugins]] and [[community plugins]].Some items are interactive but"},{"title":"Title bar","slug":"__User++++interface__Workspace__Title++++bar","shortSummary":"Title bar is the bar at the very top of Obsidian.Window titleThe window title, which is the text at the very center of the title bar, indicates the name of the current vault, as well as the current version number.NavigationAt"},{"title":"Workspace","slug":"__User++++interface__Workspace__Workspace","shortSummary":"The workspace in [[Obsidian]] contains the follow components:[[Title bar]][[Sidebar|Sidebars]][[Sidebar#Panes|Sidebar panes]][[Sidebar#Tabs|Sidebar tabs]][[Ribbon]] (left sidebar only)[[Pane layout|Panes]][[Status bar]]"},{"title":"index","slug":"__index","shortSummary":"What is MindStone?MindStone is a free open-source alternative solution to Obsidian PublishHere how it look like once published:This website include a published version of default Obsidian Help vault, [[Start here]]MindStone features:✅ Drop-in support for (default) Obsidian Vault✅ [[Wiki Link]] built-in support✅ Folder-base navigation"}],"edges":[{"source":"__Advanced++++topics__Accepted++++file++++formats","target":"__How++++to__Embed++++files"},{"source":"__Advanced++++topics__Community++++plugins","target":"__Advanced++++topics__Community++++plugins"},{"source":"__Advanced++++topics__Contributing++++to++++Obsidian","target":"__Licenses++++ambersand++++add-on++++services__Commercial++++license"},{"source":"__Advanced++++topics__Contributing++++to++++Obsidian","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish"},{"source":"__Advanced++++topics__Contributing++++to++++Obsidian","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync"},{"source":"__Advanced++++topics__Contributing++++to++++Obsidian","target":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license"},{"source":"__Advanced++++topics__Contributing++++to++++Obsidian","target":"__Advanced++++topics__Insider++++builds"},{"source":"__Advanced++++topics__Contributing++++to++++Obsidian","target":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license"},{"source":"__Advanced++++topics__Contributing++++to++++Obsidian","target":"__Advanced++++topics__Community++++plugins"},{"source":"__Advanced++++topics__Drag++++and++++Drop","target":"__How++++to__Working++++with++++multiple++++notes"},{"source":"__Advanced++++topics__Drag++++and++++Drop","target":"__Plugins__File++++explorer"},{"source":"__Advanced++++topics__Drag++++and++++Drop","target":"__Plugins__Search"},{"source":"__Advanced++++topics__Drag++++and++++Drop","target":"__Plugins__Backlinks"},{"source":"__Advanced++++topics__Drag++++and++++Drop","target":"__Plugins__Starred++++notes"},{"source":"__Advanced++++topics__Drag++++and++++Drop","target":"__Plugins__File++++explorer"},{"source":"__Advanced++++topics__Drag++++and++++Drop","target":"__Plugins__Starred++++notes"},{"source":"__Advanced++++topics__How++++Obsidian++++stores++++data","target":"__Obsidian__Obsidian"},{"source":"__Advanced++++topics__Insider++++builds","target":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license"},{"source":"__Advanced++++topics__YAML++++front++++matter","target":"__How++++to__Working++++with++++tags"},{"source":"__Advanced++++topics__YAML++++front++++matter","target":"__How++++to__Add++++aliases++++to++++note"},{"source":"__Advanced++++topics__YAML++++front++++matter","target":"__Plugins__Publish"},{"source":"__Attachments__Slides++++demo","target":"__How++++to__Internal++++link"},{"source":"__Clustering__Author++++clustering++++and++++topic++++estimation++++for++++short++++texts","target":"__Topic++++Modelling__LDA"},{"source":"__Clustering__Clustering","target":"__Recommender++++Systems__Cold-start"},{"source":"__Clustering__Clustering","target":"__Recommender++++Systems__Hybrid++++Filtering__Hybrid++++Filtering"},{"source":"__Clustering__Clustering","target":"__Recommender++++Systems__Social++++information"},{"source":"__Clustering__College++++Library++++Personalized++++Recommendation++++System","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Clustering__College++++Library++++Personalized++++Recommendation++++System","target":"__Recommender++++Systems__Content++++based__Content-based++++filtering"},{"source":"__Clustering__Evaluate++++Clustering","target":"__Measures++++and++++metrics__Mutual++++Information"},{"source":"__Clustering__Evaluate++++Clustering","target":"__Measures++++and++++metrics__Jaccard++++similarity"},{"source":"__Clustering__Evaluate++++Clustering","target":"__Measures++++and++++metrics__Kullback-Leibler++++divergence"},{"source":"__Clustering__HDBSCAN","target":"__Clustering__UMAP"},{"source":"__Clustering__HDBSCAN","target":"/"},{"source":"__Clustering__HDBSCAN","target":"/"},{"source":"__Clustering__HDBSCAN","target":"/"},{"source":"__Clustering__UMAP","target":"__Clustering__HDBSCAN"},{"source":"__Clustering__WEClustering","target":"__Machine++++Learning__DL__Transformer"},{"source":"__Clustering__WEClustering","target":"__Clustering__UMAP"},{"source":"__Concepts__Current++++version","target":"__User++++interface__Workspace__Title++++bar"},{"source":"__Concepts__Current++++version","target":"__User++++interface__Vault++++switcher"},{"source":"__Concepts__Current++++version","target":"__Concepts__Installer++++version"},{"source":"__Concepts__Installer++++version","target":"__How++++to__Update++++Obsidian"},{"source":"__Concepts__Installer++++version","target":"__Concepts__Current++++version"},{"source":"__Concepts__Installer++++version","target":"__Obsidian__Official++++website"},{"source":"__Concepts__Interface++++language","target":"__Obsidian__Credits"},{"source":"__Concepts__Interface++++language","target":"__User++++interface__Vault++++switcher"},{"source":"__Concepts__Interface++++language","target":"__Advanced++++topics__Contributing++++to++++Obsidian"},{"source":"__Customization__Appearance","target":"__How++++to__Add++++custom++++styles"},{"source":"__Customization__Custom++++hotkeys","target":"__How++++to__Use++++hotkeys"},{"source":"__Customization__Custom++++hotkeys","target":"__Plugins__Command++++palette"},{"source":"__How++++to__Add++++aliases++++to++++note","target":"__Advanced++++topics__YAML++++front++++matter"},{"source":"__How++++to__Add++++aliases++++to++++note","target":"__Plugins__Backlinks"},{"source":"__How++++to__Add++++custom++++styles","target":"__Plugins__Graph++++view"},{"source":"__How++++to__Add++++custom++++styles","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish"},{"source":"__How++++to__Add++++custom++++styles","target":"__How++++to__Add++++custom++++styles"},{"source":"__How++++to__Format++++your++++notes","target":"__How++++to__Embed++++files"},{"source":"__How++++to__Format++++your++++notes","target":"__Advanced++++topics__Using++++obsidian++++URI"},{"source":"__How++++to__Format++++your++++notes","target":"__Advanced++++topics__Using++++obsidian++++URI"},{"source":"__How++++to__Format++++your++++notes","target":"/"},{"source":"__How++++to__Format++++your++++notes","target":"/"},{"source":"__How++++to__Format++++your++++notes","target":"__How++++to__Format++++your++++notes"},{"source":"__How++++to__Format++++your++++notes","target":"__Advanced++++topics__Accepted++++file++++formats"},{"source":"__How++++to__Import++++data","target":"__Plugins__Markdown++++format++++converter"},{"source":"__How++++to__Import++++data","target":"__Plugins__Markdown++++format++++converter"},{"source":"__How++++to__Import++++data","target":"__Plugins__Markdown++++format++++converter"},{"source":"__How++++to__Import++++data","target":"__Plugins__Zettelkasten++++prefixer"},{"source":"__How++++to__Internal++++link","target":"__How++++to__Internal++++link"},{"source":"__How++++to__Internal++++link","target":"__How++++to__Folding"},{"source":"__How++++to__Internal++++link","target":"__Plugins__Page++++preview"},{"source":"__How++++to__Link++++to++++blocks","target":"__How++++to__Internal++++link"},{"source":"__How++++to__Link++++to++++blocks","target":"__How++++to__Link++++to++++blocks"},{"source":"__How++++to__Link++++to++++blocks","target":"__How++++to__Embed++++files"},{"source":"__How++++to__Manage++++attachments","target":"__Advanced++++topics__Accepted++++file++++formats"},{"source":"__How++++to__Manage++++attachments","target":"__How++++to__Capture++++information"},{"source":"__How++++to__Manage++++attachments","target":"__Plugins__File++++explorer"},{"source":"__How++++to__Preview++++and++++edit++++modes","target":"__User++++interface__Workspace__Panes__Linked++++pane"},{"source":"__How++++to__Preview++++and++++edit++++modes","target":"__Plugins__Command++++palette"},{"source":"__How++++to__Preview++++and++++edit++++modes","target":"__How++++to__Use++++hotkeys"},{"source":"__How++++to__Rename++++notes","target":"__Plugins__File++++explorer"},{"source":"__How++++to__Update++++Obsidian","target":"__Advanced++++topics__Insider++++builds"},{"source":"__How++++to__Use++++hotkeys","target":"__Plugins__Command++++palette"},{"source":"__How++++to__Use++++hotkeys","target":"__Customization__Custom++++hotkeys"},{"source":"__How++++to__Working++++with++++backlinks","target":"__User++++interface__Workspace__Panes__Linked++++pane"},{"source":"__How++++to__Working++++with++++backlinks","target":"__User++++interface__Workspace__Panes__Linked++++pane"},{"source":"__How++++to__Working++++with++++backlinks","target":"__User++++interface__Workspace__Panes__Pane++++layout"},{"source":"__How++++to__Working++++with++++backlinks","target":"__Plugins__Command++++palette"},{"source":"__How++++to__Working++++with++++multiple++++notes","target":"__User++++interface__Workspace__Panes__Linked++++pane"},{"source":"__How++++to__Working++++with++++multiple++++notes","target":"__User++++interface__Workspace__Panes__Linked++++pane"},{"source":"__How++++to__Working++++with++++multiple++++notes","target":"__User++++interface__Workspace__Panes__Linked++++pane"},{"source":"__How++++to__Working++++with++++multiple++++notes","target":"__User++++interface__Workspace__Panes__Pane++++layout"},{"source":"__How++++to__Working++++with++++multiple++++vaults","target":"__Plugins__Core++++plugins"},{"source":"__How++++to__Working++++with++++multiple++++vaults","target":"__How++++to__Add++++custom++++styles"},{"source":"__How++++to__Working++++with++++multiple++++vaults","target":"__Advanced++++topics__How++++Obsidian++++stores++++data"},{"source":"__How++++to__Working++++with++++multiple++++vaults","target":"__How++++to__Internal++++link"},{"source":"__How++++to__Working++++with++++tags","target":"__Plugins__Tag++++pane"},{"source":"__How++++to__Working++++with++++tags","target":"__Plugins__Search"},{"source":"__How++++to__Working++++with++++tags","target":"__Plugins__Tag++++pane"},{"source":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Arrays","target":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Arrays"},{"source":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Graph","target":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Recursion"},{"source":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Graph","target":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Stack"},{"source":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Graph","target":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Queue"},{"source":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Matrix","target":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Dynamic++++programming"},{"source":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Matrix","target":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Graph"},{"source":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Matrix","target":"__Interviews__Data++++Structures++++ambersand++++Algorithms__Dynamic++++programming"},{"source":"__Interviews__Data++++Structures++++ambersand++++Algorithms__String","target":"__Interviews__Data++++Structures++++ambersand++++Algorithms__String"},{"source":"__Knowledge++++Graph__Survey++++on++++Knowledge++++Graph++++for++++RecSys","target":"__Recommender++++Systems__Cold-start"},{"source":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license","target":"__Advanced++++topics__Insider++++builds"},{"source":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license","target":"__Licenses++++ambersand++++add-on++++services__Commercial++++license"},{"source":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license","target":"__Advanced++++topics__Insider++++builds"},{"source":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync"},{"source":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync","target":"__Plugins__Core++++plugins"},{"source":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Unlimited","target":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license"},{"source":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Unlimited","target":"__Advanced++++topics__Insider++++builds"},{"source":"__Licenses++++ambersand++++add-on++++services__Refund++++policy","target":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license"},{"source":"__Licenses++++ambersand++++add-on++++services__Refund++++policy","target":"__Licenses++++ambersand++++add-on++++services__Commercial++++license"},{"source":"__Licenses++++ambersand++++add-on++++services__Refund++++policy","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish"},{"source":"__Licenses++++ambersand++++add-on++++services__Refund++++policy","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync"},{"source":"__Machine++++Learning__Bias-Variance++++Tradeoff","target":"__Machine++++Learning__Overfitting"},{"source":"__Machine++++Learning__Curse++++of++++dimensionality","target":"__Machine++++Learning__PCA"},{"source":"__Machine++++Learning__Curse++++of++++dimensionality","target":"__Clustering__UMAP"},{"source":"__Machine++++Learning__DL__Adaptive++++Machine++++Translation++++with++++LLMs","target":"__Machine++++Learning__DL__Adaptive++++Machine++++Translation"},{"source":"__Machine++++Learning__DL__Adaptive++++Machine++++Translation++++with++++LLMs","target":"__Miscellaneous__Translation++++memories"},{"source":"__Machine++++Learning__DL__CNN","target":"__Recommender++++Systems__Cold-start"},{"source":"__Machine++++Learning__DL__CNN","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Machine++++Learning__DL__CNN","target":"__Recommender++++Systems__Social++++information"},{"source":"__Machine++++Learning__DL__Deep++++Reinforcement++++Learninig","target":"__Recommender++++Systems__Cold-start"},{"source":"__Machine++++Learning__DL__Neural++++Autoregressive++++Distribution++++Estimation","target":"/"},{"source":"__Machine++++Learning__DL__Neural++++attention","target":"__Machine++++Learning__DL__CNN"},{"source":"__Machine++++Learning__DL__Neural++++attention","target":"__Machine++++Learning__DL__CNN"},{"source":"__Machine++++Learning__DL__Neural++++attention","target":"__Machine++++Learning__DL__RNN"},{"source":"__Machine++++Learning__DL__PEFT++++-++++Parameter-Efficient++++Fine-Tuning","target":"/"},{"source":"__Machine++++Learning__DL__PEFT++++-++++Parameter-Efficient++++Fine-Tuning","target":"__Machine++++Learning__DL__Transformer"},{"source":"__Machine++++Learning__DL__PEFT++++-++++Parameter-Efficient++++Fine-Tuning","target":"__Machine++++Learning__DL__LoRA++++-++++Low-Rank++++Adaptation++++of++++LLMs"},{"source":"__Machine++++Learning__DL__RNN","target":"__Topic++++Modelling__Thesis__Doubts"},{"source":"__Machine++++Learning__DL__Restricted++++Boltzmann++++Machines++++(RBM)","target":"__Measures++++and++++metrics__Kullback-Leibler++++divergence"},{"source":"__Machine++++Learning__DL__Restricted++++Boltzmann++++Machines++++(RBM)","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Machine++++Learning__DL__Unlock++++LLMs'++++potential","target":"/"},{"source":"__Machine++++Learning__DL__Unlock++++LLMs'++++potential","target":"__Machine++++Learning__DL__PEFT++++-++++Parameter-Efficient++++Fine-Tuning"},{"source":"__Machine++++Learning__Kernel++++trick","target":"__Machine++++Learning__Support++++Vector++++Machine"},{"source":"__Machine++++Learning__MLOps__Artifacts","target":"__Miscellaneous__DevOps"},{"source":"__Machine++++Learning__MLOps__Intro++++to++++MLOps","target":"__Miscellaneous__DevOps"},{"source":"__Machine++++Learning__Overfitting","target":"__Machine++++Learning__Validation"},{"source":"__Machine++++Learning__Overfitting","target":"__Machine++++Learning__Regularization"},{"source":"__Machine++++Learning__Support++++Vector++++Machine","target":"__Machine++++Learning__Kernel++++trick"},{"source":"__Machine++++Learning__Types++++of++++ML++++algorithms","target":"__Clustering__Clustering"},{"source":"__Measures++++and++++metrics__Cross-Entropy","target":"__Measures++++and++++metrics__Entropy"},{"source":"__Measures++++and++++metrics__Cross-Entropy","target":"__Measures++++and++++metrics__Kullback-Leibler++++divergence"},{"source":"__Measures++++and++++metrics__Cross-Entropy","target":"/"},{"source":"__Measures++++and++++metrics__Kullback-Leibler++++divergence","target":"__Measures++++and++++metrics__Statistical++++distance"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Recommender++++Systems__Cold-start"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Accuracy"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Similarity"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Ranking++++recommendation++++metrics"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"/"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"/"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Stability++++and++++reliability"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Utility"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Novelty"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Diversity"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Unexpectedness"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Serendipity"},{"source":"__Measures++++and++++metrics__Metrics++++for++++RS","target":"__Measures++++and++++metrics__Coverage"},{"source":"__Measures++++and++++metrics__Statistical++++distance","target":"__Measures++++and++++metrics__Mutual++++Information"},{"source":"__Measures++++and++++metrics__Unexpectedness","target":"__Measures++++and++++metrics__Mutual++++Information"},{"source":"__Miscellaneous__Amazon++++DSSTNE","target":"__Miscellaneous__Apache++++Spark"},{"source":"__Miscellaneous__CCA++++-++++A++++Multi-View++++Embedding++++Space++++for++++Modeling++++Internet++++Images,++++Tags,++++and++++their++++Semantics","target":"__Topic++++Modelling__PLSA"},{"source":"__Miscellaneous__Curse++++of++++dimensionality","target":"__Machine++++Learning__PCA"},{"source":"__Miscellaneous__Fuzzy++++Matches","target":"__Miscellaneous__Translation++++memories"},{"source":"__Obsidian__Android++++app","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync"},{"source":"__Obsidian__Android++++app","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync"},{"source":"__Obsidian__Android++++app","target":"__Advanced++++topics__Using++++obsidian++++URI"},{"source":"__Obsidian__Mobile++++app++++beta","target":"__Obsidian__Obsidian++++Mobile"},{"source":"__Obsidian__Mobile++++app++++beta","target":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license"},{"source":"__Obsidian__Mobile++++app++++beta","target":"__Advanced++++topics__Insider++++builds"},{"source":"__Obsidian__Mobile++++app++++beta","target":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license"},{"source":"__Obsidian__Obsidian++++Mobile","target":"__Obsidian__Android++++app"},{"source":"__Obsidian__Obsidian++++Mobile","target":"__Obsidian__iOS++++app"},{"source":"__Obsidian__Obsidian","target":"__How++++to__Internal++++link"},{"source":"__Obsidian__Obsidian","target":"__How++++to__Internal++++link"},{"source":"__Obsidian__Obsidian","target":"__Plugins__Graph++++view"},{"source":"__Obsidian__Obsidian","target":"__Obsidian__Obsidian"},{"source":"__Obsidian__Obsidian","target":"__Plugins__Audio++++recorder"},{"source":"__Obsidian__Obsidian","target":"__Plugins__Slides"},{"source":"__Obsidian__Obsidian","target":"__Plugins__Backlinks"},{"source":"__Obsidian__Obsidian","target":"__Plugins__Graph++++view"},{"source":"__Obsidian__Obsidian","target":"__Plugins__Word++++count"},{"source":"__Obsidian__Obsidian","target":"__Advanced++++topics__Customizing++++CSS"},{"source":"__Obsidian__Obsidian","target":"__Advanced++++topics__Community++++plugins"},{"source":"__Obsidian__Official++++website","target":"__Concepts__Installer++++version"},{"source":"__Obsidian__Official++++website","target":"__Licenses++++ambersand++++add-on++++services__Catalyst++++license"},{"source":"__Obsidian__Official++++website","target":"__Licenses++++ambersand++++add-on++++services__Commercial++++license"},{"source":"__Obsidian__Official++++website","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync"},{"source":"__Obsidian__Official++++website","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish"},{"source":"__Obsidian__iOS++++app","target":"__Obsidian__iOS++++app"},{"source":"__Obsidian__iOS++++app","target":"__Obsidian__iOS++++app"},{"source":"__Obsidian__iOS++++app","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync"},{"source":"__Obsidian__iOS++++app","target":"__Advanced++++topics__Using++++obsidian++++URI"},{"source":"__Plugins__Audio++++recorder","target":"/"},{"source":"__Plugins__Core++++plugins","target":"__Obsidian__Obsidian"},{"source":"__Plugins__Core++++plugins","target":"__Advanced++++topics__Community++++plugins"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__File++++explorer"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Search"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Quick++++switcher"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Graph++++view"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Backlinks"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Outgoing++++links"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Tag++++pane"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Page++++preview"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Daily++++notes"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Templates"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Note++++composer"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Command++++palette"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Starred++++notes"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Markdown++++format++++converter"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Zettelkasten++++prefixer"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Random++++note"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Outline"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Word++++count"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Slides"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Audio++++recorder"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Open++++in++++default++++app"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Workspaces"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__File++++recovery"},{"source":"__Plugins__Core++++plugins","target":"__Plugins__Publish"},{"source":"__Plugins__Core++++plugins","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync"},{"source":"__Plugins__Daily++++notes","target":"__Plugins__Command++++palette"},{"source":"__Plugins__Daily++++notes","target":"__How++++to__Use++++hotkeys"},{"source":"__Plugins__Daily++++notes","target":"__Plugins__Templates"},{"source":"__Plugins__File++++explorer","target":"__Advanced++++topics__Accepted++++file++++formats"},{"source":"__Plugins__File++++explorer","target":"__How++++to__Create++++notes"},{"source":"__Plugins__File++++explorer","target":"__How++++to__Rename++++notes"},{"source":"__Plugins__File++++explorer","target":"__How++++to__Embed++++files"},{"source":"__Plugins__File++++recovery","target":"__Advanced++++topics__How++++Obsidian++++stores++++data"},{"source":"__Plugins__Graph++++view","target":"__How++++to__Internal++++link"},{"source":"__Plugins__Graph++++view","target":"__Advanced++++topics__Customizing++++CSS"},{"source":"__Plugins__Graph++++view","target":"__Plugins__Graph++++view"},{"source":"__Plugins__Note++++composer","target":"__Plugins__Command++++palette"},{"source":"__Plugins__Note++++composer","target":"__Plugins__Command++++palette"},{"source":"__Plugins__Note++++composer","target":"__Plugins__File++++recovery"},{"source":"__Plugins__Outgoing++++links","target":"__Plugins__Backlinks"},{"source":"__Plugins__Outgoing++++links","target":"__How++++to__Add++++aliases++++to++++note"},{"source":"__Plugins__Publish","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish"},{"source":"__Plugins__Publish","target":"__Advanced++++topics__YAML++++front++++matter"},{"source":"__Plugins__Publish","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish"},{"source":"__Plugins__Publish","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish"},{"source":"__Plugins__Publish","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish"},{"source":"__Plugins__Publish","target":"__Plugins__Page++++preview"},{"source":"__Plugins__Random++++note","target":"__Customization__Custom++++hotkeys"},{"source":"__Plugins__Search","target":"__Plugins__File++++explorer"},{"source":"__Plugins__Search","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Publish"},{"source":"__Plugins__Search","target":"__How++++to__Format++++your++++notes"},{"source":"__Plugins__Search","target":"__How++++to__Format++++your++++notes"},{"source":"__Plugins__Search","target":"__How++++to__Format++++your++++notes"},{"source":"__Plugins__Starred++++notes","target":"__Plugins__Command++++palette"},{"source":"__Plugins__Starred++++notes","target":"__How++++to__Use++++hotkeys"},{"source":"__Plugins__Templates","target":"__Plugins__Daily++++notes"},{"source":"__Plugins__Templates","target":"__Plugins__Zettelkasten++++prefixer"},{"source":"__Plugins__Workspaces","target":"__Plugins__Command++++palette"},{"source":"__Plugins__Zettelkasten++++prefixer","target":"__Plugins__Templates"},{"source":"__Recommender++++Systems__Cold-start","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Cold-start","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Cold-start","target":"__Recommender++++Systems__Content++++based__Content-based++++filtering"},{"source":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering","target":"__Recommender++++Systems__Content++++based__Content-based++++filtering"},{"source":"__Recommender++++Systems__Collaborative++++Filtering__Memory-based++++methods","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Collaborative++++Filtering__Memory-based++++methods","target":"__Measures++++and++++metrics__Similarity"},{"source":"__Recommender++++Systems__Collaborative++++Filtering__Model-based++++methods","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Collaborative++++Filtering__kNN","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Collaborative++++Filtering__kNN","target":"__Measures++++and++++metrics__Similarity"},{"source":"__Recommender++++Systems__Collaborative++++Filtering__kNN","target":"__Recommender++++Systems__Cold-start"},{"source":"__Recommender++++Systems__DL++++models","target":"__Machine++++Learning__DL__Autoencoder"},{"source":"__Recommender++++Systems__DL++++models","target":"/"},{"source":"__Recommender++++Systems__DL++++models","target":"__Recommender++++Systems__Multilayer++++Perceptron"},{"source":"__Recommender++++Systems__DL++++models","target":"__Machine++++Learning__DL__CNN"},{"source":"__Recommender++++Systems__DL++++models","target":"__Machine++++Learning__DL__RNN"},{"source":"__Recommender++++Systems__DL++++models","target":"__Machine++++Learning__DL__Autoencoder"},{"source":"__Recommender++++Systems__DL++++models","target":"/"},{"source":"__Recommender++++Systems__DL++++models","target":"__Machine++++Learning__DL__Neural++++attention"},{"source":"__Recommender++++Systems__DL++++models","target":"__Machine++++Learning__DL__Neural++++Autoregressive++++Distribution++++Estimation"},{"source":"__Recommender++++Systems__DL++++models","target":"__Machine++++Learning__DL__Adversarial++++Networks"},{"source":"__Recommender++++Systems__DL++++models","target":"__Machine++++Learning__DL__Deep++++Reinforcement++++Learninig"},{"source":"__Recommender++++Systems__DL++++models","target":"__Machine++++Learning__DL__Transformer"},{"source":"__Recommender++++Systems__How++++to++++use++++textual++++data","target":"/"},{"source":"__Recommender++++Systems__Hybrid++++Filtering__Hybrid++++Filtering","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Hybrid++++Filtering__Hybrid++++Filtering","target":"__Recommender++++Systems__Demographic++++Filtering__Demographic++++filtering"},{"source":"__Recommender++++Systems__Hybrid++++Filtering__Hybrid++++Filtering","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Hybrid++++Filtering__Hybrid++++Filtering","target":"__Recommender++++Systems__Content++++based__Content-based++++filtering"},{"source":"__Recommender++++Systems__Multilayer++++Perceptron","target":"__Recommender++++Systems__Neural++++Collaborative++++Filtering"},{"source":"__Recommender++++Systems__Multilayer++++Perceptron","target":"/"},{"source":"__Recommender++++Systems__Multilayer++++Perceptron","target":"__Machine++++Learning__DL__Wide++++ambersand++++Deep++++Learning"},{"source":"__Recommender++++Systems__Multilayer++++Perceptron","target":"/"},{"source":"__Recommender++++Systems__Neural++++Collaborative++++Filtering","target":"__Recommender++++Systems__Multilayer++++Perceptron"},{"source":"__Recommender++++Systems__Neural++++Collaborative++++Filtering","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Neural++++Collaborative++++Filtering","target":"__Recommender++++Systems__Collaborative++++Filtering__Matrix++++factorization"},{"source":"__Recommender++++Systems__Neural++++Collaborative++++Filtering","target":"__Recommender++++Systems__Multilayer++++Perceptron"},{"source":"__Recommender++++Systems__Neural++++Collaborative++++Filtering","target":"__Machine++++Learning__Losses"},{"source":"__Recommender++++Systems__Sequential++++RS__Chameleon","target":"__Recommender++++Systems__Hybrid++++Filtering__Hybrid++++Filtering"},{"source":"__Recommender++++Systems__Sequential++++RS__Chameleon","target":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS"},{"source":"__Recommender++++Systems__Sequential++++RS__Chameleon","target":"/"},{"source":"__Recommender++++Systems__Sequential++++RS__CoSeRNN","target":"__Machine++++Learning__DL__RNN"},{"source":"__Recommender++++Systems__Sequential++++RS__CoSeRNN","target":"__Recommender++++Systems__Sequential++++RS__JODIE-Predicting++++Dynamic++++Embedding++++Trajectory++++in++++Temporal++++Interaction++++Networks"},{"source":"__Recommender++++Systems__Sequential++++RS__JODIE-Predicting++++Dynamic++++Embedding++++Trajectory++++in++++Temporal++++Interaction++++Networks","target":"__Machine++++Learning__DL__RNN"},{"source":"__Recommender++++Systems__Sequential++++RS__NxtPost++++-++++User++++to++++Post++++Recommendations++++in++++Facebook++++Groups","target":"__Recommender++++Systems__Content++++based__Content-based++++filtering"},{"source":"__Recommender++++Systems__Sequential++++RS__NxtPost++++-++++User++++to++++Post++++Recommendations++++in++++Facebook++++Groups","target":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS"},{"source":"__Recommender++++Systems__Sequential++++RS__NxtPost++++-++++User++++to++++Post++++Recommendations++++in++++Facebook++++Groups","target":"__Machine++++Learning__DL__Transformer"},{"source":"__Recommender++++Systems__Sequential++++RS__NxtPost++++-++++User++++to++++Post++++Recommendations++++in++++Facebook++++Groups","target":"__Machine++++Learning__DL__Wide++++ambersand++++Deep++++Learning"},{"source":"__Recommender++++Systems__Sequential++++RS__NxtPost++++-++++User++++to++++Post++++Recommendations++++in++++Facebook++++Groups","target":"__Recommender++++Systems__Cold-start"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Recommender++++Systems__Multi-task++++learning"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Recommender++++Systems__Sequential++++RS__BERT4Rec"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Machine++++Learning__DL__Transformer"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Recommender++++Systems__Collaborative++++Filtering__kNN"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Recommender++++Systems__Collaborative++++Filtering__Matrix++++factorization"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Machine++++Learning__DL__RNN"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Machine++++Learning__DL__CNN"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"/"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Machine++++Learning__DL__Neural++++attention"},{"source":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS","target":"__Recommender++++Systems__Cold-start"},{"source":"__Recommender++++Systems__Text-based++++collaborative++++filtering++++for++++cold-start++++soothing++++and++++recommendation++++enrichment","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Recommender++++Systems__Text-based++++collaborative++++filtering++++for++++cold-start++++soothing++++and++++recommendation++++enrichment","target":"__Recommender++++Systems__Cold-start"},{"source":"__SQL__SQL++++Syntax","target":"__SQL__SQL++++JOIN"},{"source":"__Start++++here","target":"__Obsidian__Obsidian"},{"source":"__Start++++here","target":"__Plugins__Command++++palette"},{"source":"__Start++++here","target":"__How++++to__Create++++notes"},{"source":"__Start++++here","target":"__How++++to__Internal++++link"},{"source":"__Start++++here","target":"__How++++to__Format++++your++++notes"},{"source":"__Start++++here","target":"__How++++to__Embed++++files"},{"source":"__Start++++here","target":"__How++++to__Use++++hotkeys"},{"source":"__Start++++here","target":"__How++++to__Working++++with++++multiple++++notes"},{"source":"__Start++++here","target":"__Plugins__Core++++plugins"},{"source":"__Start++++here","target":"__Obsidian__Obsidian"},{"source":"__Start++++here","target":"__How++++to__Basic++++note++++taking"},{"source":"__Start++++here","target":"__Advanced++++topics__Insider++++builds"},{"source":"__Start++++here","target":"__How++++to__Basic++++note++++taking"},{"source":"__Start++++here","target":"__How++++to__Import++++data"},{"source":"__Start++++here","target":"__Obsidian__Obsidian"},{"source":"__Topic++++Modelling__Autoencoding++++variational++++inference++++for++++topic++++models","target":"__Topic++++Modelling__LDA"},{"source":"__Topic++++Modelling__BERTopic","target":"__Topic++++Modelling__Clusters++++on++++word++++embeddings"},{"source":"__Topic++++Modelling__BERTopic","target":"__Topic++++Modelling__Top2Vec"},{"source":"__Topic++++Modelling__BERTopic","target":"__Clustering__UMAP"},{"source":"__Topic++++Modelling__BERTopic","target":"__Measures++++and++++metrics__Mutual++++Information"},{"source":"__Topic++++Modelling__BERTopic","target":"__Topic++++Modelling__Combined++++Topic++++Modelling"},{"source":"__Topic++++Modelling__Clusters++++on++++word++++embeddings","target":"__Topic++++Modelling__LDA"},{"source":"__Topic++++Modelling__Clusters++++on++++word++++embeddings","target":"__Measures++++and++++metrics__Mutual++++Information"},{"source":"__Topic++++Modelling__Collaborative++++Topic++++Modeling","target":"__Topic++++Modelling__LDA"},{"source":"__Topic++++Modelling__Combined++++Topic++++Modelling","target":"__Machine++++Learning__DL__Autoencoder"},{"source":"__Topic++++Modelling__Combined++++Topic++++Modelling","target":"__Measures++++and++++metrics__Mutual++++Information"},{"source":"__Topic++++Modelling__Concept","target":"__Clustering__UMAP"},{"source":"__Topic++++Modelling__Concept","target":"__Clustering__HDBSCAN"},{"source":"__Topic++++Modelling__Concept","target":"__Miscellaneous__Maximal++++Marginal++++Relevance"},{"source":"__Topic++++Modelling__LDA","target":"__Topic++++Modelling__PLSA"},{"source":"__Topic++++Modelling__PLSA","target":"__Topic++++Modelling__LSA"},{"source":"__Topic++++Modelling__PLSA","target":"__Topic++++Modelling__LDA"},{"source":"__Topic++++Modelling__Thesis__2nd++++phase","target":"__Clustering__Evaluate++++Clustering"},{"source":"__Topic++++Modelling__Thesis__2nd++++phase","target":"/"},{"source":"__Topic++++Modelling__Thesis__2nd++++phase","target":"__Topic++++Modelling__BERTopic"},{"source":"__Topic++++Modelling__Thesis__2nd++++phase","target":"__Recommender++++Systems__Sequential++++RS__Sequential++++RS"},{"source":"__Topic++++Modelling__Thesis__2nd++++phase","target":"__Recommender++++Systems__Sequential++++RS__BERT4Rec"},{"source":"__Topic++++Modelling__Thesis__Background++++for++++Topic++++Modeling","target":"__Topic++++Modelling__Topic++++modelling"},{"source":"__Topic++++Modelling__Thesis__Background++++for++++Topic++++Modeling","target":"__Clustering__Evaluate++++Clustering"},{"source":"__Topic++++Modelling__Thesis__Bibliography++++for++++our++++results","target":"__Topic++++Modelling__BERTopic"},{"source":"__Topic++++Modelling__Thesis__Bibliography++++for++++our++++results","target":"__Topic++++Modelling__Top2Vec"},{"source":"__Topic++++Modelling__Thesis__Bibliography++++for++++our++++results","target":"__Measures++++and++++metrics__Similarity"},{"source":"__Topic++++Modelling__Thesis__Doubts","target":"/"},{"source":"__Topic++++Modelling__Thesis__Doubts","target":"/"},{"source":"__Topic++++Modelling__Thesis__Doubts","target":"__Recommender++++Systems__Cold-start"},{"source":"__Topic++++Modelling__Thesis__Doubts","target":"/"},{"source":"__Topic++++Modelling__Thesis__Doubts","target":"/"},{"source":"__Topic++++Modelling__Thesis__Doubts","target":"/"},{"source":"__Topic++++Modelling__Thesis__Doubts","target":"/"},{"source":"__Topic++++Modelling__Thesis__Doubts","target":"/"},{"source":"__Topic++++Modelling__Thesis__Ideas","target":"__Machine++++Learning__DL__Data2Vec++++-++++A++++General++++Framework++++for++++Self-supervised++++Learning++++in++++Speech,++++Vision++++and++++Language"},{"source":"__Topic++++Modelling__Thesis__Ideas","target":"__Topic++++Modelling__Top2Vec"},{"source":"__Topic++++Modelling__Thesis__Ideas","target":"__Topic++++Modelling__BERTopic"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Recommender++++Systems__Sequential++++RS__BERT4Rec"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Recommender++++Systems__Sequential++++RS__NxtPost++++-++++User++++to++++Post++++Recommendations++++in++++Facebook++++Groups"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Recommender++++Systems__Collaborative++++Filtering__kNN"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Topic++++Modelling__Thesis__My++++Sequential++++RS"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Topic++++Modelling__Thesis__My++++Sequential++++RS"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Topic++++Modelling__Thesis__My++++Sequential++++RS"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Recommender++++Systems__Sequential++++RS__CoSeRNN"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Recommender++++Systems__Sequential++++RS__BERT4Rec"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Topic++++Modelling__Concept"},{"source":"__Topic++++Modelling__Thesis__My++++Sequential++++RS","target":"__Machine++++Learning__DL__CLIP++++-++++Contrastive++++Language-Image++++Pre-Training"},{"source":"__Topic++++Modelling__Thesis__Notes++++on++++Cluster++++RS","target":"__Clustering__Cluster++++Consensus"},{"source":"__Topic++++Modelling__Thesis__Notes++++on++++Cluster++++RS","target":"__Clustering__HDBSCAN"},{"source":"__Topic++++Modelling__Thesis__Notes++++on++++Cluster++++RS","target":"__Recommender++++Systems__Collaborative++++Filtering__Collaborative++++filtering"},{"source":"__Topic++++Modelling__Thesis__Paper++++review++++TO-DO","target":"__Topic++++Modelling__BERTopic"},{"source":"__Topic++++Modelling__Thesis__Paper++++review++++TO-DO","target":"/"},{"source":"__Topic++++Modelling__Thesis__Paper's++++Sections","target":"__Topic++++Modelling__Thesis__Background++++for++++Topic++++Modeling"},{"source":"__Topic++++Modelling__Thesis__Problems++++with++++Easytour++++data","target":"__Recommender++++Systems__Sequential++++RS__CoSeRNN"},{"source":"__Topic++++Modelling__Thesis__Random++++notes++++on++++clustering","target":"__Topic++++Modelling__Top2Vec"},{"source":"__Topic++++Modelling__Thesis__Random++++notes++++on++++clustering","target":"__Topic++++Modelling__BERTopic"},{"source":"__Topic++++Modelling__Thesis__Random++++notes++++on++++clustering","target":"/"},{"source":"__Topic++++Modelling__Thesis__Random++++notes++++on++++clustering","target":"__Topic++++Modelling__BERTopic"},{"source":"__Topic++++Modelling__Thesis__Random++++notes++++on++++clustering","target":"__Topic++++Modelling__Combined++++Topic++++Modelling"},{"source":"__Topic++++Modelling__Thesis__Random++++notes++++on++++clustering","target":"__Machine++++Learning__DL__Autoencoder"},{"source":"__Topic++++Modelling__Thesis__Thoughts++++on++++results","target":"__Measures++++and++++metrics__Coherence"},{"source":"__Topic++++Modelling__Thesis__Thoughts++++on++++results","target":"__Measures++++and++++metrics__Kullback-Leibler++++divergence"},{"source":"__Topic++++Modelling__Thesis__Thoughts++++on++++results","target":"__Topic++++Modelling__Thesis__Study++++topic++++parameters"},{"source":"__Topic++++Modelling__Thesis__Thoughts++++on++++results","target":"__Measures++++and++++metrics__Mutual++++Information"},{"source":"__Topic++++Modelling__Thesis__Thoughts++++on++++results","target":"__Topic++++Modelling__Top2Vec"},{"source":"__Topic++++Modelling__Thesis__Thoughts++++on++++results","target":"__Topic++++Modelling__Top2Vec"},{"source":"__Topic++++Modelling__Top2Vec","target":"__Clustering__HDBSCAN"},{"source":"__Topic++++Modelling__Top2Vec","target":"__Clustering__UMAP"},{"source":"__Topic++++Modelling__Top2Vec","target":"__Measures++++and++++metrics__Mutual++++Information"},{"source":"__Topic++++Modelling__Top2Vec","target":"__Topic++++Modelling__LDA"},{"source":"__Topic++++Modelling__Top2Vec","target":"__Topic++++Modelling__PLSA"},{"source":"__Topic++++Modelling__Topic++++Modeling++++in++++Embedding++++Spaces","target":"__Topic++++Modelling__LDA"},{"source":"__Topic++++Modelling__Topic++++Modelling++++Meets++++Deep++++Neural++++Networks++++-++++A++++Survey","target":"__Topic++++Modelling__Topic++++modelling"},{"source":"__Topic++++Modelling__Topic++++Modelling++++Meets++++Deep++++Neural++++Networks++++-++++A++++Survey","target":"__Topic++++Modelling__LDA"},{"source":"__Topic++++Modelling__Topic++++Modelling++++Meets++++Deep++++Neural++++Networks++++-++++A++++Survey","target":"__Recommender++++Systems__DL++++models"},{"source":"__Topic++++Modelling__Topic++++Modelling++++Meets++++Deep++++Neural++++Networks++++-++++A++++Survey","target":"__Machine++++Learning__DL__Autoencoder"},{"source":"__Topic++++Modelling__Topic++++Modelling++++Meets++++Deep++++Neural++++Networks++++-++++A++++Survey","target":"__Measures++++and++++metrics__Kullback-Leibler++++divergence"},{"source":"__Topic++++Modelling__Topic++++modelling","target":"__Topic++++Modelling__LDA"},{"source":"__User++++interface__Vault++++switcher","target":"__User++++interface__Workspace__Ribbon"},{"source":"__User++++interface__Vault++++switcher","target":"__User++++interface__Vault++++switcher"},{"source":"__User++++interface__Vault++++switcher","target":"__User++++interface__Vault++++switcher"},{"source":"__User++++interface__Vault++++switcher","target":"__Concepts__Current++++version"},{"source":"__User++++interface__Vault++++switcher","target":"__Concepts__Interface++++language"},{"source":"__User++++interface__Workspace__Panes__Linked++++pane","target":"__How++++to__Preview++++and++++edit++++modes"},{"source":"__User++++interface__Workspace__Panes__Linked++++pane","target":"__How++++to__Working++++with++++backlinks"},{"source":"__User++++interface__Workspace__Panes__Linked++++pane","target":"__Plugins__Backlinks"},{"source":"__User++++interface__Workspace__Panes__Linked++++pane","target":"__Plugins__Backlinks"},{"source":"__User++++interface__Workspace__Panes__Pane++++layout","target":"__Obsidian__Obsidian"},{"source":"__User++++interface__Workspace__Panes__Pane++++layout","target":"__Plugins__File++++explorer"},{"source":"__User++++interface__Workspace__Panes__Pane++++layout","target":"__Plugins__Search"},{"source":"__User++++interface__Workspace__Panes__Pane++++layout","target":"__Plugins__Backlinks"},{"source":"__User++++interface__Workspace__Panes__Pane++++layout","target":"__Plugins__Graph++++view"},{"source":"__User++++interface__Workspace__Panes__Pane++++layout","target":"__User++++interface__Workspace__Panes__Pane++++layout"},{"source":"__User++++interface__Workspace__Panes__Pane++++layout","target":"__User++++interface__Workspace__Sidebar"},{"source":"__User++++interface__Workspace__Panes__Pane++++layout","target":"__Plugins__Workspaces"},{"source":"__User++++interface__Workspace__Ribbon","target":"__User++++interface__Workspace__Sidebar"},{"source":"__User++++interface__Workspace__Ribbon","target":"__Plugins__Core++++plugins"},{"source":"__User++++interface__Workspace__Ribbon","target":"__Advanced++++topics__Community++++plugins"},{"source":"__User++++interface__Workspace__Ribbon","target":"/"},{"source":"__User++++interface__Workspace__Ribbon","target":"/"},{"source":"__User++++interface__Workspace__Ribbon","target":"/"},{"source":"__User++++interface__Workspace__Ribbon","target":"__Obsidian__Obsidian++++Mobile"},{"source":"__User++++interface__Workspace__Sidebar","target":"__User++++interface__Workspace__Ribbon"},{"source":"__User++++interface__Workspace__Sidebar","target":"__User++++interface__Workspace__Sidebar"},{"source":"__User++++interface__Workspace__Sidebar","target":"__User++++interface__Workspace__Sidebar"},{"source":"__User++++interface__Workspace__Status++++bar","target":"__Plugins__Core++++plugins"},{"source":"__User++++interface__Workspace__Status++++bar","target":"__Advanced++++topics__Community++++plugins"},{"source":"__User++++interface__Workspace__Status++++bar","target":"__Plugins__Word++++count"},{"source":"__User++++interface__Workspace__Status++++bar","target":"__Licenses++++ambersand++++add-on++++services__Obsidian++++Sync"},{"source":"__User++++interface__Workspace__Workspace","target":"__Obsidian__Obsidian"},{"source":"__User++++interface__Workspace__Workspace","target":"__User++++interface__Workspace__Title++++bar"},{"source":"__User++++interface__Workspace__Workspace","target":"__User++++interface__Workspace__Sidebar"},{"source":"__User++++interface__Workspace__Workspace","target":"__User++++interface__Workspace__Sidebar"},{"source":"__User++++interface__Workspace__Workspace","target":"__User++++interface__Workspace__Sidebar"},{"source":"__User++++interface__Workspace__Workspace","target":"__User++++interface__Workspace__Ribbon"},{"source":"__User++++interface__Workspace__Workspace","target":"__User++++interface__Workspace__Panes__Pane++++layout"},{"source":"__User++++interface__Workspace__Workspace","target":"__User++++interface__Workspace__Status++++bar"},{"source":"__index","target":"__Start++++here"}]}